[
  {
    "path": "posts/2023-12-27-how-to-remove-silence-at-start-and-end-of-songs-in-your-music-collection/",
    "title": "How to remove silence at start and end of songs in your music collection",
    "description": "After failing to remove the songs's silences only from the start or the end with FFmpeg, I ended up using an open-source tool (mp3splt-gtk) to achieve this. It did not have a particular good default settings for this purpose but it ended up doing a perfect job.",
    "author": [
      {
        "name": "Ricardo Montero Rubert",
        "url": {}
      }
    ],
    "date": "2023-12-27",
    "categories": [],
    "contents": "\r\nIntroduction: Why am I doing this?\r\nIn case you don’t know I have an ongoing project of restoring an old radio which has kept me busy (more or less) for the last 5 years. In fact, this is the second post related to this topic. The first post is about organising your music library. In that case the organising was required so that each song has the correct idiom, decade, and genre in order to create different radio stations (playlists).\r\n\r\n\r\n\r\nFigure 1: The guilty one\r\n\r\n\r\n\r\nThe radio is fully functional now, and it does exactly what I wanted. Mimic a radio. I will try to be brief because this post is not about the radio. But basically, I have several playlists that are “radio stations”. That playlist should reproduce a song at a precise moment based on the system’s internal clock. That is at 12:00:00 you might be hearing Bon Jovi - Bed of Roses at time 45 seconds, and if you return to the station at 12:01:10 then you will be listening to the same song but this time in the 115-second position. When a song ends, it just skips to the next one.\r\nYou can probably see where this is going. If a song has an ending silence of up to 25 seconds, and the next song has a silence at the start of 5 seconds. This appears as 30 seconds of silence which is extremely awkward or you could tune in right in the silence and think it broke. The easiest solution is to trim these silences. If you are curious, herein-below there is a video of the radio working.\r\nSoftware tried for this solution\r\nInitially, this post was going to be about FFmpeg and how I used it for this purpose, but I couldn’t work out the specific command to remove a silence only if starts at time 0, and only if it finishes at time “song’s end”. So I had to keep investigating, I investigated Audacity, MPsplit and mp3splt-gtk before deciding to proceed with the latest one.\r\nFFmpeg\r\n\r\n\r\n\r\nFigure 2: Audacity\r\n\r\n\r\n\r\nFFmpeg is a great tool, it can do pretty much anything as long as you have got the right command and as long as you know how to use it. For this purpose, I was using the silenceremove command, whose reference page is here. But I am no FFmpeg wizard and my script which should only delete silence either at the very start and at the very end of the song, leaving in-between silence untouched. In reality, it gets rid of any single silence that encounters. The script is written in Powershell and if you feel brave enough to edit you can download it here. I didn’t and gave up after several attempts and looked for other software.\r\nFFmpeg’s main caveat is that it deals with one and only one file at a time. So you need to use another language (in my case Powershell) to control everything else.\r\nFFmpeg is destructive, it will uncompress and recompress, but unless Audacity, you can configure the bit-rate of the output.\r\nIt keeps a copy of all ID tags in the new mp3. But only ID3v2, all the ID3v1 and APE are gone.\r\nIt messes up with song duration, sometimes making it appear to be longer than it is.1\r\nThe script is based on this FFmpeg command:\r\nffmpeg -i \"input.mp3\" -af \"silenceremove=start_periods=1:start_duration=0.046:start_threshold=-50dB,silenceremove=stop_periods=-1:stop_duration=0.046:stop_threshold=-46dB\" -b:a 320k -write_xing 0 -y \"output_trimmed.mp3\"\r\nAudacity\r\n\r\n\r\n\r\nFigure 3: Audacity\r\n\r\n\r\n\r\nI am surprised with the quality of Audacity has gotten in the latest versions. However, whilst doing a very good job at finding silences and trimming them. It has a few caveats:\r\nAudacity does not have a batch tool per se. It uses a macro system which does not allow you to control which songs will be modified or not. It will modify every single song in the folder.\r\nAudacity does not make it easy to script around itself. You are limited to the macros it has and no control structures such as if-else.\r\nIt is not able to deal with folder structures, it will process all mp3s in a folder, and then you must reorganise as you please.\r\nIt exports at whatever bit-rate you did for your last export. That means that if you use 320kbps, it will export every song of the folder at that bit-rate, even songs with smaller bit-rate, increasing their size massively. And making now believe that the song is a higher bit-rate than actually is.2\r\nIt is destructive, it will read the song, get the waveform, and then export it. Meaning that some quality will be lost in the process.\r\nMPtrim\r\n\r\n\r\n\r\nFigure 4: MPtrim\r\n\r\n\r\n\r\nMPtrim is a paid software that does an excellent job at trimming one and only one song, with plenty of options and free to use.\r\nYou need the PRO version in order to batch songs or folders.\r\nThe PRO version costs 70 American dollars, and it is only for a yearly license!3\r\nIf I had less than 20 songs, I would go for this, but with the amount ranking over 300, I shall pass.\r\nMp3splt (and Mp3splt-gtk)\r\n\r\n\r\n\r\nFigure 5: Mp3splt-gtk\r\n\r\n\r\n\r\nMp3splt is a great tool to deal with silences. It has not been updated since 2014, so do not expect any new features. The software is focused on splitting recordings of a whole CD/Vinyl/Cassette, into different files. However, also is able to deal with silences only at the start and end of a song, whilst ignoring any silence in-between.\r\nIt uses a not destructive4 method.\r\nIt trims the song perfectly.\r\nYou need some configuration tweaking that is not very straightforward if you want to keep the original ID tags, and mimic input folder structure.\r\nHow to use the software\r\nGo to the Mp3splt website and make sure you donwload the mp3splt-gtk 0.9.2 version. Uncompress the zip and then locate the mp3splt-gtk.exe and run it. You need to use the second tab, the one called “Batch & Automatic split”, the first one is kind of useless for our purpose as it is to remove silence manually one by one.\r\nFrom the options below, make sure to select the one that says Trim using silence detection, and set up the threshold level you want (Anything between -50dB and -42dB is fine). The program has some questionable default values5, but if you click on the Batch split button on the top right corner it should kind of work.\r\nLets gonna configure the application to keep the original ID tags and replicate the folder structure. Go to Application > Preferences.\r\nSplit tab:\r\nMake sure to use a custom directory and point it to an empty folder\r\nOn Split options, make sure that only the option to Create directories from filenames is selected. However, this option is not enough by itself to do what it claims it does.\r\n\r\nTags tab:\r\non Tag version; make sure that Same tags version as the input file is selected\r\non Split files tags; make sure that Original file tags is selected\r\n\r\nOutput format:\r\nSelect Custom format and write, this step is necessary to mimic the folder structure:\r\nWindows: @d\\@f\r\nLinux/Mac: @d/@f\r\nIf you want to have the song with a suffix, like input_trim.mp3, add trim at the end like @d\\@f__trim\r\n\r\n\r\nNow you can close the preferences, press the Batch split button, go for a coffee and let the software do its job.\r\n\r\nThis took me a lot of searching and trial and error and it seems that the flag -write_xing 0 must be added right before the output filename to solve it.↩︎\r\nI could have dealt with the other problems, but this one was the real deal-breaker.↩︎\r\nI do not support any subscription business. So game over.↩︎\r\nI tried to test this by inverting one of the trimmed songs, aligning it, and then combining the tracks. If they carbon-copies the results should be silent, but it wasn’t. However, I did not spend much time aligning as it is a tedious task.↩︎\r\nI guess they make sense for the original purpose of the software, split a vinyl recording into several files, but not for our purpose.↩︎\r\n",
    "preview": "posts/2023-12-27-how-to-remove-silence-at-start-and-end-of-songs-in-your-music-collection/images/miniatura.jpg",
    "last_modified": "2024-08-04T13:59:32+01:00",
    "input_file": "removing-silence-from-songs-using-ffmpeg.knit.md"
  },
  {
    "path": "posts/2023-06-17-making-my-first-game-another-pong-in-python/",
    "title": "Making my first game (another Pong) in Python.",
    "description": "Thanks to the power of Python and the open-source library Pyxel I have managed to make my very first game, a Pong game. Pyxel is a library that helps to make retro-like games. The path was no bed of roses but the game is 100% playable, and you can play in your browser.",
    "author": [
      {
        "name": "Ricardo Montero Rubert",
        "url": {}
      }
    ],
    "date": "2023-06-17",
    "categories": [],
    "contents": "\r\nI started 2023 with a rather long list of things I wanted to achieve, and one of those things was to code a Tetris clone. Let me tell you right here, right now, that I have not succeeded at making a Tetris clone.\r\nTL;DR: Play the game in Browser or Download Exe\r\nWhy? Because the path of making your first game is a rather steep process, and if you are learning git and object-oriented programming whilst your background is RCS and structured programming learnt in a Fortran90 university course many years ago it reaches absolutely nonsense levels.\r\n\r\n\r\n\r\nFigure 1: A screenshot of the game, with the debug mode activated.\r\n\r\n\r\n\r\nSo I had to compromise, and as I still wanted to make a game, I settled on the most simple game ever done. The pong. Or so I thought. I have been able to make a fairly stable prototype, that has most of the features that I wanted to have. Check aside or at the end of the post to play.\r\nMajor hitting walls\r\nCollisions\r\nThe first problem I encountered was collisions. We have been suffering from them since they were invented by Sir Isaac Newton back in 1687. I was expecting that in those 336 years, someone would have come up with something to deal with them, but that was not the case and I was delighted to build my own collision methods. Thank you, Newton.\r\nSo I rolled up my sleeves and also decided that my collision engine should distinguish on which side the collision has happened. Why? Because I wanted to make my life harder and be able to hit with the platform side for a speed bonus.\r\nThree different approaches later and I have got a collision system that works okay at least. The side detection is a little bit flickery at times and if the ball moves too fast it skips the collision and crosses the platform, just like in the real world!1\r\nThe Menu\r\nI wanted to have an elementary menu that allowed me to choose between what type of games, a few options, and display a scoring ranking which I have not been able to implement at all.\r\n\r\n\r\n\r\nFigure 2: The menu, nobody would think that some letters in a black screen could take that much time\r\n\r\n\r\n\r\nMy initial approach was to hard-code everything into the game as a dictionary of dictionaries which eventually would lead to a function that was executed. That went chaotic quickly and the menu ended up being its own class which returns a number. The game now gets the number and with a switch-case alike structure does whatever is needed instead.\r\nThe menu is not quite polished, its main caveat is that it can’t show the selected options. For example, which difficulty is currently set in the game). This is a clear action to be solved in the future, especially if I want to reuse the menu code for any future game.\r\nThe Computer\r\nEvery human needs a computer to play against, so I had to code one. My first attempt was straightforward, to track the ball’s height position and match it with the computer’s platform. It works for low speeds but the computer is doomed as soon as the vertical speed goes over the speed is allowed to move the platform.\r\nA harder opponent was required and that is how the moderate IA was born. It can predict the location where the ball will hit, and move the platform there. It has some gibberish introduced into their calculations which reduces as the ball is closer. It aims to hit the ball with the centre of the platform but the gibberish will likely avoid it. I think this level is too intelligent for its own good and if I ever work on it I would like to make it more dumb.\r\nFinally, the hard mode tweaks the moderate IA for even finer improvement. First, the computer is not being away with fairies when the ball moves towards the player, as it now centres its platform in the middle of the screen, plus it will hit the ball precisely to send it the furthest possible to the human’s platform.\r\nFinal Conclusion\r\nI had a lot of fun while doing this game, and although in the current version (0.13) there are quite a few things to improve like the menu not being able to show selected options, the moderate AI being an impressive adversary or the lack of ranking and scores.\r\nThe game has performed its objective, to make me familiar with the system so that I can eventually make that Tetris game I always wanted to do.\r\nIt might also entertain you for a while, you can play on your browser here, or download Exe the Windows executable here. As usual the Virus Total report can be seen here.\r\n\r\nAlthough in the real world, it typically makes a hole as a sub-product of the collision↩︎\r\n",
    "preview": "posts/2023-06-17-making-my-first-game-another-pong-in-python/images/image3.png",
    "last_modified": "2024-02-29T20:47:00+00:00",
    "input_file": {},
    "preview_width": 698,
    "preview_height": 501
  },
  {
    "path": "posts/2022-12-30-repurposing-an-old-pinnacle-tv-capture-card/",
    "title": "Repurposing an old Pinnacle TV capture card",
    "description": "As an analogue video-capturing device. In this post, I explain how to make an old tv Pinnacle capture card (chipset Bt848) work in a modern Windows 10 x64 pro. Using a modded version of DScaler, we can use either the composite or S-video entrance to capture analogue video signals such as the PSone.",
    "author": [
      {
        "name": "Ricardo Montero Rubert",
        "url": "https://blog.rmrubert.eu/about"
      }
    ],
    "date": "2022-12-30",
    "categories": [],
    "contents": "\r\nI have a drawer full of cables, cards, memory sticks, etcetera. Basically old junk that sits there peacefully until someone disturbs it when looking for an unusual cable. And a few days ago, I was indeed looking for a weird cable for one of the projects on my (Spanish) Youtube channel when I stumbled upon this thing here.\r\nMy old tv capture card, Pinnacle miroVideo PCTV pro. Long time used to watch analogue tv on my previous computer and decode Nagravision TV channels like the extinct Canal+, but today being completely useless given the fact that there is no analogue TV anymore. However, the capture card has an S-video and a composite video entrance in addition to the already mentioned now useless analogue TV decoder1.\r\n\r\n\r\n\r\nFigure 1: Pinnacle miroVideo PCTV pro with bt848 decoder chip\r\n\r\n\r\n\r\nAs I have been recently fiddling around with my old PSone which outputs everything via RGB. Would I be able to make it work, so that I can record myself playing the PSone? I started looking around and I found that it is fairly easy to make them work if you are using Linux. But I am using Windows 10 x64, and this card was made more than 18 years ago, with Windows XP 32-bit drivers.\r\nBelow this paragraph, you will find a (Spanish) video showing how the PSone image is being transferred into my computer and the instructions on how to achieve it. Additionally, I have added several other drivers that I found whilst I was testing my setup. Those drivers did not work for me on my computer, but they might work on yours.\r\n\r\nMy solution\r\nYou need:\r\nA PCI (not PCIe) free slot in your motherboard.\r\nA BIOS in your motherboard can run in legacy mode. If your motherboard only runs in UEFI mode, it is game over for you.\r\nA TV card with the chipset BT848. Cards with BT878 chips are reported to work, but I have not tested them.\r\nYou need to install DScaler 4.2.3, this is an unofficial version done by RedFox.\r\nBackup Installer\r\nBackup Code\r\nForum post.\r\nRedFox’s website.\r\n\r\nOnce installed you need to replace the files in the DScaler installation folder with the files modded by Elianda.\r\nBackup Files\r\nBackup Code (Recompressed)\r\nForum post\r\nElianda’s Files\r\nElianda’s website\r\n\r\nYou need to install DirectX 9 compatibility layer for Windows 10, called Directplay which can be found on the Control panel > Turn Windows features on or off > Legacy Component > Restart your computer.\r\nEnglish Step by Step\r\nSpanish Step by Step\r\n\r\nOpen DScaler, when it asks about the card make sure to select yours, in my case is Pinnacle PCTV Pro. Auto-Detect did not work at all in my case.\r\nWhen asked about using DirectX press yes.\r\n\r\n\r\n\r\nFigure 2: Don’t forget to select your model, otherwise it won’t work.\r\n\r\n\r\n\r\nNotes\r\nNote 1: Virus total gives some positive malware in the unofficial DScaler\r\nDScaler 4.2.3 and 4.2.3a are not official developments of DScaler. The latest stable version of DScaler is 4.1.15, and the latest alpha version is 4.2.2. I have analysed the files through VirusTotal (4.2.3 and 4.2.3a), and some antivirus detects some malware in them.\r\nGiven the fact that my Fortran game, which I am pretty sure is clean because I compiled myself, also has some false positives2. I am pretty sure that false positives are a thing and are likely to be the case here. However, proceed with caution.\r\nNote 2: Not installing drivers\r\nThe beauty of this system is that you do not need to install any driver. DScaler own drivers can make it work on the fly.\r\nNote 3: Only works within DScaler\r\nBecause you are not installing any driver, the capture card, and thus whatever signals it arrives through is only visible via DScaler. This means that you can’t use more modern software like OBS to get the signal. But you can set OBS to record the windows of DScaler.\r\nOther drivers\r\nIn this quest, I encountered several drivers that people claimed worked for them, but they didn’t for me. Finding drivers for old stuff ain’t easy, so I have added them here just in case they can be used by you, my fellow reader.\r\nOriginal Pinnacle miroVideo PCTV pro CD\r\nWindows Vista 64 bits drivers for Pinnacle PCTV Pro.\r\nAvermedia BT848 and BT878 drivers\r\nITVC-1 SuperTVpro SAA7134\r\nEmp (5.2009.0416.0) Win7-Beta\r\nBT848CCD\r\nPinnacle miroVideo PCTV pro Manual PDF\r\nThen as a bonus, you can still access the FTP of Pinnacle (as in at the date of writing) with plenty of old drivers and stuff. Install FileZilla and set it up like this:\r\nServer\r\nftp.pctvsystems.com\r\nUser\r\n(Empty)\r\nPass\r\n(Empty)\r\nPort\r\n(Empty)\r\nClick on “fast connection”, and you can find a lot of drivers (TV/driver), manuals (TV/documentation), and software (TV/application). I have a local copy of this FTP in case it disappears, no idea how can I save a copy online. So if it disappears and you need something, you will need to find me and ask for it politely.\r\n\r\nI am not completely sure it is useless. Some old equipment had video output through channel 21 of the TV, and technically, it could be used to get this video. However, I have not found a way to tune in to a specific channel on DScaler, and neither I own such equipment to test it.↩︎\r\nAt least Kapersky removed the false positive when I complained but the other antivirus software still lab it as a Trojan.↩︎\r\n",
    "preview": "posts/2022-12-30-repurposing-an-old-pinnacle-tv-capture-card/images/game.jpg",
    "last_modified": "2024-08-04T13:37:23+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-10-27-use-of-jupyter-notebooks-on-arcgis-pro-to-display-flood-results/",
    "title": "Use of Jupyter notebooks on ArcGIS pro to display flood results",
    "description": "Yet another post about how to optimise the workflow of plotting hydraulic results using GIS software. This time I will use the Jupyter notebook function inside of ArcGIS.",
    "author": [
      {
        "name": "Ricardo Montero Rubert",
        "url": "https://blog.rmrubert.eu/about"
      }
    ],
    "date": "2022-10-27",
    "categories": [],
    "contents": "\r\nIn the previous post, I rambled about how GIS software is not optimised at all to plot hydraulic results from simulations. Head over there if you are interested in the rambling, here I will present a different approach.\r\nTL;DR: Go to Jupyter notebook\r\nAccording to the last step of the Iñigo Montoya1 method for networking, I should be managing your expectations for this post. So what can you expect from reading this post?\r\n\r\n\r\n\r\nFigure 1: Learning networking with Iñigo Montoya.\r\n\r\n\r\n\r\nI would be expecting that you can export multiple layouts after reading this post. So don’t disappoint me. How? Well, this time we are using the functionality of the Jupyter notebook included in ArcGIS. They will allow us to export a batch of layouts, whilst switching on and off the visibility of the involved layers. The code is simple and with minimal Python knowledge, you should be able to tailor it to your own needs.\r\nBut first, what is a (Jupyter) notebook? A notebook is a way of presenting information where every piece of information (named cells) relies on previous pieces to advance to achieve whatever the purpose of the notebook is. Cells can contain images and text, but more importantly, they can contain snippets of code that will execute and show results.\r\nMy first contact with a notebook was as a student at Uni. I was using Wolfram Mathematica and it was a deal breaker. I could program an assignment, and if the teacher made up their mind before the delivery date. The only thing I need to do was to make the modification, run everything, and print it as a PDF. Boom! No more hours having to redo an assignment. On the other hand, being the only student using Mathematica made me an easy target to be tracked by professors.\r\n\r\n\r\n\r\nFigure 2: ArcGIS PRO, showing 1 map, and 1 layout (Depth).\r\n\r\n\r\n\r\nTo start you will need to have an ArcGIS project (.aprx) already set up. This means at least one map2, with one layout3 per variable4, the layers must have their symbology applied and all layouts and legends should be sorted out.\r\nIn my example, I have one map, with 9 layers. The 9 layers are results (Depth, Velocity and Water Surface Elevation) for hypothetical5 high, medium and low flows on Bald Eagle Creek.\r\nNow we can proceed with the notebook. Open a new Jupyter notebook, this can be done in the Insert tab, New Notebook. Which in my case was in the third position starting on the left.\r\nNotebook\r\nYou can download a copy of the Jupyter notebook here. You can download a copy of the whole ArcGIS project and layers used in the notebook here. For simplicity, each cell herewith has a little guidance.\r\n\r\n\r\n\r\nFigure 3: ArcGIS PRO screenshot, showing 1 map (Map), and 3 layouts (Depth, Velocity, WSE) and 9 layers from result plus another one for ground.\r\n\r\n\r\n\r\nCell 1: Select project\r\nYou should have only one project open. Order all your layers so that all variable layers (depth, velocity, etc…) are sitting together. I recommend ordering them following a pattern. Save the project, and whilst you run the Jupyter notebook refrain from adding, moving, editing or modifying anything in the project, but if you do, restart again from cell 1.\r\nCode in:\r\n# Save project before running this\r\naprx = arcpy.mp.ArcGISProject(\"CURRENT\")\r\nCell 2: Show list of maps\r\nWe call a list of maps in the project saved at the variable aprx. In the loop, we print their location within the list. Mind that Python starts numbering lists (actually anything) on 0 instead of 1.\r\nCode in:\r\n# Show list of maps\r\naprx.listMaps()\r\ni=0\r\nfor mp in aprx.listMaps():\r\n    print( str(i)+\": \"+mp.name)\r\n    i=i+1\r\nOutput:\r\n0: Map\r\nCell 3: Select map you want to work with\r\nWe are working with one map. Select the map that you are interested in by its position on cell 2. For this example, the map should contain all layers.\r\nCode in:\r\n# Select the Map you want to work with \r\nSelect = 0\r\nmpr = aprx.listMaps()[Select]\r\nOutput:\r\n\r\nCell 4: Show list of layers\r\nAs before we show a list with the layers contained in the map, and add their position to the list.\r\nCode in:\r\n# Show list of Layers\r\ni=0\r\nfor m in mpr.listLayers():\r\n    print( str(i) + \": \"+ m.name )\r\n    i=i+1\r\nOutput:\r\n0: Depth (High)\r\n1: Depth (Low)\r\n2: Depth (Medium)\r\n3: Velocity (High)\r\n4: Velocity (Low)\r\n5: Velocity (Medium)\r\n6: WSE (High)\r\n7: WSE (Low)\r\n8: WSE (Medium)\r\n9: Ground Elevation\r\n10: World Hillshade\r\n11: World Topographic Map\r\nCell 5: Select list of layers\r\nIf you don’t have all the layers ordered as a continuous group, do it now and return to cell 1. The idea is that you can select the raster as a couple of numbers. In this case, we are interested in switching through all layers from 0 to 8.\r\nCode in:\r\n# Select the boundaries of the layers to be changed\r\nunvis0 = 0\r\nunvis1 = 8\r\nOutput:\r\n\r\nCell 6: Show a list of layouts\r\nWe print a list of the layouts available in the project. We need to assign one layout to each layer in a future cell, so keep this list handy.\r\nCode in:\r\n# Show list of layouts\r\naprx.listLayouts()\r\ni=0\r\nfor ly in aprx.listLayouts():\r\n    print(str(i)+\": \"+ly.name)\r\n    i=i+1\r\nOutput:\r\n0: Velocity\r\n1: WSE\r\n2: Depth\r\nCell 7: Define the function\r\nYou need to run this cell, but you shouldn’t need to edit it, at least for this example. The function calls the map layer (mpr) and three integer such as \\(novis0 \\leq vis \\leq novis1\\). The function deactivates all layers in the range novis0-novis1, except for vis which always is active. This function will be called inside of a loop in a future cell.\r\nCode in:\r\n# Don't change anything in this function unless you know what are you doing\r\n# But run the cell to define the function\r\ndef onlyvis(mpr,novis0,novis1,vis):\r\n    # Makes everything invisible from novis0 to novis1 then makes vis visible in the mpr map\r\n    i=novis0\r\n    for m in mpr.listLayers()[novis0:novis1]:\r\n        m.visible = False\r\n        if (novis0==vis):\r\n            print( str(i)+\": \"+m.name)\r\n        i=i+1\r\n\r\n    mpr.listLayers()[vis].visible = True\r\nOutput:\r\n\r\nCell 8: Create list with paths to were png will be written to\r\nTo define where the layout will be saved we create a vector of paths. The vector should have as many paths as layers are in the novis0-novis1 group. I have used raw strings to not have problems with backslashes ( \\ ). Raw strings are created by placing an r in front of the first quotation mark. I like to use the column mode6 on notepad++ when working with paths, this is the reason why I have a strict policy of keeping the same number of characters at any cost.\r\nCode in:\r\n# Fill the list with the saving path, must be a raw string define as r\"STRING\"\r\n# Remember it must match the position shown on cell 6.\r\npathto = [\r\n    r\"C:\\temp\\DPT_High.png\",\r\n    r\"C:\\temp\\DPT_Low-.png\",\r\n    r\"C:\\temp\\DPT_Medi.png\",\r\n    r\"C:\\temp\\VEL_High.png\",\r\n    r\"C:\\temp\\VEL_Low-.png\",\r\n    r\"C:\\temp\\VEL_Medi.png\",\r\n    r\"C:\\temp\\WSE_High.png\",\r\n    r\"C:\\temp\\WSE_Low-.png\",\r\n    r\"C:\\temp\\WSE_Medi.png\"\r\n]\r\nOutput:\r\n\r\nCell 9: Create list to assign a layout to each layer\r\nSimilarly, we need to create now a vector that selects the layout that will be used for each layer. The numbers on this vector should match the output on cell 6. Because the layer 0, 1, and 2 are velocity (layout=0), layers 3,4 and 5 are WSE (layout=2) and layers 6, 7 and 8 are Depth (layout=1). We need to build the vector below.\r\nCode in:\r\n# Create a vector with what layout each variable will be using\r\n# In this example 0 is Velocity, 1 is WSE and 2 is Depth as per cell 8.\r\n# It must match the position of the cell 6\r\n\r\nlayoutsel = [0,0,0,2,2,2,1,1,1]\r\nOutput:\r\n\r\nCell 10: Export all layers into PNG\r\nAgain, this is a piece of code you don’t need to edit. Just click on run and if you have done everything properly you should be getting the PNG at the desired (Cell 8) locations. It will overwrite anything that exists with that name, so don’t be clumsy!\r\nCode in:\r\nfor j in range(len(layoutsel)):\r\n    # Select layout from layoutsel\r\n    lyd = aprx.listLayouts()[layoutsel[j]]\r\n    exppath = pathto[j]\r\n    # Change map to only visible\r\n    onlyvis(mpr,unvis0,unvis1+1,j+unvis0)\r\n    # Export\r\n    print(\"Exporting : \"+str(j)+\" : \"+exppath)\r\n    lyd.exportToPNG(exppath,resolution = 300)\r\nprint(\"FINISHED\")\r\nOutput:\r\n0: Depth (High)\r\n1: Depth (Low)\r\n2: Depth (Medium)\r\n3: Velocity (High)\r\n4: Velocity (Low)\r\n5: Velocity (Medium)\r\n6: WSE (High)\r\n7: WSE (Low)\r\n8: WSE (Medium)\r\nExporting : 0 : C:\\temp\\DPT_High.png\r\nExporting : 1 : C:\\temp\\DPT_Low-.png\r\nExporting : 2 : C:\\temp\\DPT_Medi.png\r\nExporting : 3 : C:\\temp\\VEL_High.png\r\nExporting : 4 : C:\\temp\\VEL_Low-.png\r\nExporting : 5 : C:\\temp\\VEL_Medi.png\r\nExporting : 6 : C:\\temp\\WSE_High.png\r\nExporting : 7 : C:\\temp\\WSE_Low-.png\r\nExporting : 8 : C:\\temp\\WSE_Medi.png\r\nFINISHED\r\n\r\nNo joke, it is a great method. I would like that any worker sent by my landlord present themselves with an SMS that actually contains the 4 steps within the SMS instead of “What time can I go on Tuesday?”↩︎\r\nArcGIS projects have maps and layouts. A map contains layers. Layouts usually will include at least one map.↩︎\r\nLayouts show how the plot is printed, and likely you would need to configure one per variable, as the legends will be different for each variable.↩︎\r\nA not obvious trick. You can copy and paste a layout from the catalogue menu, by right-clicking on it and pasting it into the parent folder.↩︎\r\nNotice how in this example I explicitly avoid using units, return period or something similar. It is because everything shown here is just mock-up runs.↩︎\r\nColumn mode is activated by Shift+Alt+LeftMouseClick and at the same time drawing the cursor down.↩︎\r\n",
    "preview": "posts/2022-10-27-use-of-jupyter-notebooks-on-arcgis-pro-to-display-flood-results/images/04.png",
    "last_modified": "2023-01-11T21:08:02+00:00",
    "input_file": {},
    "preview_width": 1920,
    "preview_height": 1040
  },
  {
    "path": "posts/2022-06-18-a-script-to-automatize-the-plot-of-several-raster-in-the-same-q-gis-layout/",
    "title": "A script to automatize the plot of several rasters in the same Q-GIS layout",
    "description": "I present MultiLayout. A still (little bit) clunky Q-GIS workspace and a python script that would help you at plotting the results of hydraulic simulations.",
    "author": [
      {
        "name": "Ricardo Montero Rubert",
        "url": "https://blog.rmrubert.eu/about"
      }
    ],
    "date": "2022-06-18",
    "categories": [],
    "contents": "\r\nOne problem that consistently GIS software has been unable to provide a solution to is when you need to plot the same map layout with a set of rasters.\r\nI imagine the main reason is that traditional GIS users do not encounter this problem1.\r\nTL;DR: Quick Download of Q-GIS workspace.\r\nBut in flood risk assessment, it is quite common to plot results at a certain location, and those results will vary.\r\nThere will be different variables such as flood depths, water elevation or velocity.\r\nEach storm duration, event or scenario will produce a set of results to be plotted, and boy, they do add up quickly.\r\nThe results usually will share a legend, colour schemes and location.\r\nOnly the layer containing the results will vary.\r\nWe are in 2022 and yet no GIS software has an easy way to tell, hey you, iterate through this bunch of rasters and give some neat png instead.\r\n\r\n\r\n\r\nFigure 1: An example of what a messy a set of results can look like if plotted together\r\n\r\n\r\n\r\nSomeone needed to solve this hassle and looks like someone was me.\r\nIn reality, this is the second time I have come up with a solution to this problem.\r\nMy previous solution was based on R and ggplot.\r\nThe plots looked neat, but the code was only understood by 3-years-ago-me.\r\nSo this time I decided to go with Q-GIS and try to keep it simple.\r\nIt also has the advantage that I don’t need to travel in time every time I want to use it.\r\nDownload\r\nSo here is the very first version of MultiLayout.\r\nConsists of a qgz workspace, a set of folders, a python script2, and a tsv3 file.\r\nDownload here\r\nAt the moment MultiLayout is quite clunky4 but I have decided to publish it as it is and keep upgrading according to the feedback I receive if I got any.\r\nInstructions\r\nIt is actually more complex to explain than to do it.\r\nOpen the QGIS workspace and set all the common layers needed.\r\nBackground mapping, rivers shapefiles, etc…\r\nDo not set yet the layers that the code will iterate to plot them.\r\n\r\nNow open the master layout and modify it to your needs.\r\nYou might want to have a different layout for each variable\r\nYou need to configure the map view to the right location.\r\nConfigure the bar scale, north arrow, etc…\r\nThe title and disclaimer can be moved, but if they are deleted the code won’t work.\r\nMake sure to configure the legend and leave it as a no-auto-update.\r\nI recommend using an invisible layer for this.\r\nSave as a copy somewhere safe.\r\n\r\nOpen the file MultiLayout.tsv.txt which is a tab-separated file.\r\nI use Excel for that (drag and drop into excel)\r\nID: A number with the ID.\r\nNot used and can be empty,\r\nNraster: Not used and can be empty,\r\nNshp: Not used and can be empty,\r\nExportPath: The path where the png is going to be saved,\r\nTitle: The title text will be replaced with this cell,\r\nDisclaimer: The disclaimer text will be replaced with this cell,\r\nRasterPath_01: Path to the raster file that will be added on top of existing layers,\r\nRasterStyle_01: The style that will be applied to the layer, and\r\nLayout: The name of the layout that will be used, you should have one for each different variable.\r\n\r\nOpen Qgis and go to Plugins, then click on Python Console.\r\nClick on the third button (Show Editor).\r\nOn the editor, open the Script_01.py and modify lines 2 and 4.\r\nLine 2 should point to the saved qgz.\r\nLine 4 should point to the tsv.txt file.\r\nMake sure the path is in between the quotes with an r before as in r”C:.ext”\r\n\r\nClick on the green triangle to run the code.\r\nYou should see the titles appear in the Python Console.\r\n\r\n\r\n\r\nFigure 2: Steps four, five and six.\r\n\r\n\r\n\r\nSo what is next?\r\nAt the moment the script is rather basic. It is only able to add a raster layer per layout, and it will be always located on top of everything else. If I find it useful, I will try to make it more powerful. Ideally, I would like it to become a Q-GIS plugin if I find the time to do so.\r\n\r\nIf the maps are fairly distinct they won’t share a legend or scale, and each one should be on its own workspace.\r\nOn the other hand, if you want to plot something like an elevation map or a land-type map, you will only need one map (per location).↩︎\r\nWhere the magic happens.↩︎\r\nI have gone with a tab-separated file because I keep changing between Spanish and English layout where CSV is separated by “;” or “,”, and the tab solves this problem neatly.↩︎\r\nand yet it is still light-years away than setting multiple layouts by yourself.↩︎\r\n",
    "preview": "posts/2022-06-18-a-script-to-automatize-the-plot-of-several-raster-in-the-same-q-gis-layout/images/Picture_1.png",
    "last_modified": "2022-12-08T10:15:27+00:00",
    "input_file": {},
    "preview_width": 1442,
    "preview_height": 1020
  },
  {
    "path": "posts/2021-12-24-an-analysis-of-the-effects-of-panel-markers-on-a-cross-sections-conveyance-curve/",
    "title": "An analysis of the effects of panel markers on a cross-section's conveyance curve",
    "description": "In this article, I present the effects of panelling a 1D cross-section. Panelling is the terminology used by the software Flood Modeller™ to divide the cross-section's hydraulic properties (mostly the hydraulic radius) into a sum of them. The article contains a theory introduction about Manning's n formula and 5 cross-sections are analysed with different panelling scenarios.",
    "author": [
      {
        "name": "Ricardo Montero Rubert",
        "url": "https://blog.rmrubert.eu/about"
      }
    ],
    "date": "2021-12-24",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nWhat is panelling\r\nWhy is panelling used?\r\nProblématique\r\n\r\nTheory\r\nThe Manning formula\r\nThe hydraulic radius\r\nThe cross-section conveyance\r\n\r\nMethodology\r\nCase 1: Geometric shape of Canal and left flood plain\r\nCase 2: Trapezoidal cross-section\r\nCase 3: Cross-section with manmade wall\r\nCase 4: Cross-section with undeveloped floodplain\r\nCase 5: Large cross-section\r\n\r\nConclusions\r\nDisclaimer\r\n\r\n\r\nIntroduction\r\nWhat is panelling\r\nPanelling is the action of locating one or more panel markers in a Flood Modeller™ cross-section. Thus, dividing its hydraulic properties, as if they were several cross-sections placed in parallel. The Flood Modeller’s help declares that A panel marker subdivides the channel into a number of vertical panels that should reflect the geometry of the channel. The conveyance of each of these panels will then be calculated individually as opposed to calculating conveyance across the full width of the channel as a whole. Then, summed across the channel. (Flood Modeller Team n.d.)\r\nAlthough this article focuses on Flood Modeller’s way of panelling. It is important to note that other hydraulic software provides similar functionality. For instance, HEC-RAS auto-panels the cross-section when you set up a Left or Right Bank at those locations, subdividing the cross-section into 3 different sections. (Goodell 2017)\r\nHowever, HEC-RAS limits the user to use two panel markers (divisors), hence 3 different zones, whilst Flood Modeller allows the user to set up or introduce as many panel markers as the user might want. Indeed, it is technically possible to panel every XZ pair of the cross-section.\r\nWhy is panelling used?\r\nThere are cases in which a cross-section holds information from parts that behave hydraulically different. For instance, a floodplain and the main channel will (likely) have different roughness; or in braided channels, each channel might have different roughness.\r\n\r\n\r\n\r\nFigure 1: Flood Modeller’s showing a cross-section and its associated conveyance in function of the stage\r\n\r\n\r\n\r\nDuring those cases, depending on the geometric shape of the cross-section, the conveyance curve can have a negative spike1. An example of spike can be seen at an elevation of 4m in Figure 1. The ambiguity of having two possible water elevations for a given flow usually produce instabilities2. Thus, panelling can (and should) be used to eliminate those spikes and have a well-behaved continuously growing conveyance curve3.\r\nProblématique\r\nPanelling is a powerful tool that is able to remove negative spikes that produce instabilities in our model. But it has a price. The price is that each panel marker alters the properties of the cross-section. Concretely, it reduces the roughness, which translates as a larger conveyance. A larger conveyance means more flow per stage.\r\nI have encountered models with a large number of panel markers4 without realising the secondary effects of panelling. The mere act of (just) adding a panel marker at any location reduces the roughness of the cross-section, letting the cross-section hold and convey more water.\r\nThis article has the purpose of making the reader aware of the consequences of improper panelling. Supporting my point based on theory and 5 analysis cases. At the end of the article, the reader should understand how adding unnecessary panel markers tweaks the cross-section conveyance.\r\nTheory\r\nThe Manning formula\r\nMost of the free-flow computational hydraulics software uses the Manning’s n formula. The Manning’s n formula is an empirical formula to estimate the average velocity of a liquid flowing in an open channel flow (Chow 1985) and it is defined as:\r\n\\[\r\nV = \\frac{1}{n} R_h ^\\frac{2}{3} \\cdot S^\\frac{1}{2}\r\n\\]\r\nWhere \\(V\\) is the average velocity, \\(n\\) is a dimensional roughness coefficient, \\(R_h\\) is the hydraulic radius and \\(S\\) is the slope of the channel.\r\nBefore continuing, I need to highlight a few things about this widely used formula, that quite often gets overlooked. In order to get Manning’s equation, there are two important simplifications that have been done.\r\nThe first simplification is that the slope (\\(S\\)) must be substantially small to admit that \\(S \\simeq tan(S)\\)(Charpentier 2018). Hence, be careful when using this equation for steep slopes.\r\nThe second simplification is that the term \\(\\frac{1}{n} R_h ^\\frac{2}{3}\\) is a roughness term obtained applying a Taylor series simplification over the event probability of energy contribution of all roughness terms (Charpentier 2018). There are two important things to keep in mind. The first one, this term is a Taylor approximation. The second one, the hydraulic radius \\(R_h\\) and the Manning coefficient \\(n\\) (both of them when) together represents the roughness.\r\nThe n term is not the only term representing the roughness, the hydraulic radius \\(R_h\\) term also represents roughness. This is important because each new panel marker alters the hydraulic radius of the cross-section. In other words, each new panel marker smooths the cross-section roughness. Each new panel marker increases the cross-section conveyance.\r\nThe hydraulic radius\r\nWe have determined that this term \\(\\frac{1}{n} R_h ^\\frac{2}{3}\\) represent the cross-section roughness. But what exactly is the hydraulic radius?\r\nThe hydraulic radius is defined as:\r\n\\[\r\nR_h = \\frac{A}{W_p}\r\n\\]\r\nWhere \\(A\\), is the Cross-Sectional area of flow, and \\(W_p\\) is the wetted perimeter, or in other words, the total wetted length across the cross-section. When we increase the water depth (\\(y\\)) on a cross-section, we are increasing both terms, the area and the wetted perimeter. But they do not necessarily increase at the same rate. If the increase of \\(W_p\\) is much rapid than the increase in \\(A\\), the hydraulic radius \\(R_h\\) decreases. Producing the aforementioned spikes.\r\nFor instance, check Figure 2. When the water depth reaches the floodplain (\\(y = 4m\\)) a small increase in the water depth barely increases the area (\\(A\\)), but it increases substantially the wetted perimeter (\\(W_p\\)). This situation produces that hydraulic radius (green line) decreases. Spikes in the hydraulic radius will likely produce spikes in the conveyance of the cross-section.\r\n\r\n\r\n\r\n\r\nFigure 2: Cross-Section and its calculated hydraulic radius per water depth\r\n\r\n\r\n\r\nIt is fairly complex to understand how the hydraulic properties of a cross-section change by looking at the hydraulic radius. This is because the hydraulic radius is not an intuitive variable. It has length dimensions, but it does not measure length. It measures roughness, the roughness is expressed as a coefficient between area (amount of water) and wetted perimeter (part of the water with friction).\r\nThe cross-section conveyance\r\nMultiplying the Manning’s right and left term by the Area we can obtain the flow \\(Q(y)\\) as a function of the water depth \\(y\\):\r\n\\[\r\nV \\cdot A = Q = \\frac{1}{n} \\cdot R_h ^\\frac{2}{3} \\cdot A \\cdot S^\\frac{1}{2}\r\n\\]\r\nIn this equation we call conveyance \\(K\\) to the term( USACE Hydrologic Engineering Center n.d.):\r\n\\[\r\nK = \\frac{1}{n} \\cdot R_h ^\\frac{2}{3} \\cdot A\r\n\\]\r\nSo the flow can be defined as:\r\n\\[\r\nQ(y) = K(y) \\cdot S^\\frac{1}{2}\r\n\\]\r\nThe conveyance \\(K(y)\\) will vary based on two parameters the hydraulic radius \\(R_h(y)\\) and the area \\(A(y)\\), both are geometric functions that depend on the water depth \\(y\\).\r\nWhen a panel marker is placed, the hydraulic properties of the cross-sections are divided into 2 zones. In figure 3 those zones have been called B (floodplain) and A (channel). Then the conveyance of each zone is calculated (independently) for a given depth, and the sum of them produces the conveyance of the panelled cross-section. Adding more panel markers add more terms (zones) to the summation.\r\n\\[\r\n  K =\\sum_{i=1}^{n}K_i = K_A + K_B\r\n\\]\r\n\\[\r\nK= \\frac{1}{n_A} \\cdot (R_h)_A ^\\frac{2}{3} \\cdot A_A + \\frac{1}{n_B} \\cdot (R_h)_B ^\\frac{2}{3} \\cdot A_B\r\n\\]\r\n\r\n\r\n\r\n\r\nFigure 3: Conveyance value of a cross-section with 1 panel marker\r\n\r\n\r\n\r\nMethodology\r\nFive cross-sections will be analysed. Case 1 will analyse the cross-section seen in figure 3. Case 2 will analyse a symmetrical trapezoid section that does not need any panel marker. Case 3 is based on a real-life cross-section with a well-defined channel. Case 4 is based on a real-life cross-section that is oddly shaped and contains partial information from its floodplains. Case 5 is a n extense real-life cross-section.\r\nFor simplification, the Manning’s n value used on all cases is \\(n=0.035\\).\r\nEach case will have different scenarios. Each scenario will place the panel markers at different locations. The conveyance curve of each scenario will be obtained and compared against the no panel markers scenario.\r\nEach case will have 4 tabs, the first tab contains the plot graph of the cross-section, each scenario conveyance and each scenario panel markers location. You can click on the legend to show and hide them. The second tab contains a small table comparing each scenario against the no panel markers scenario. The third and fourth tabs contain tabular data for QA purposes.\r\nThe best way to check where the panel markers are placed for each scenario is to click on the plot’s legend to see where the panel markers are.\r\nFor easiness, I have tried to come with some common scenarios names, not all the named scenarios are in all cases. In my opinion, the first three are the most important scenarios, but we can obtain some conclusions from the other scenarios.\r\nSimple: Or no panel markers scenario. Other scenarios will be compared against this scenario.\r\nFrugal-panelling: When a cross-section contains only 2 panel markers. This is the same limitation that HEC-RAS has.\r\nSuper-panelling: When a cross-section contains at least 2 or more panel markers than the frugal option.\r\nSingle: Locating one panel marker only, dividing the section into 2 zones. This case is especially important on (artificial) geometric cross-section to see the influence that a panel marker can produce.\r\nOver: A middle situation between Frugal and Super. Used when the Frugal scenario is unable to remove all the spikes.\r\nBed: I have seen some cross-sections whose panel markers are not at the top of the embankment, but rather at the extreme of the bed levels. This scenario tries to represent this situation.\r\nEvery: In this extreme scenario a panel marker is placed on every single possible location.\r\nOther: Scenarios that cannot be classified on the previous categories will receive a different name.\r\nCase 1: Geometric shape of Canal and left flood plain\r\nIn this study case, we are analysing the cross-section used on previous figures to see how it reacts to different scenarios. The cross-section is formed by a flat floodplain and the main channel. The right bank of the cross-section is a vertical wall. The “Frugal” scenario is formed by only one panel marker dividing the floodplain from the main channel. The “Super” scenario adds another one on the left bed channel. The “Every” scenario produces an absurdly large conveyance, the reason is explained below.\r\n\r\n\r\n\r\n\r\n\r\nSimple\r\n\r\n\r\n\r\n\r\nFigure 4: Case 1, Geometric shape of Canal and left flood plain\r\n\r\n\r\n\r\n\r\n\r\nDifferences\r\n\r\n\r\nConveyance difference compared against Simple scenario.\r\n    \r\n      Max K [m³/s]\r\n      Difference [m³/s]\r\n      Difference %\r\n    Simple\r\n877.533\r\n0.000\r\n0.000Frugal\r\n878.428\r\n0.895\r\n0.102Super\r\n889.664\r\n12.131\r\n1.382Every\r\n1623.632\r\n746.099\r\n85.022\r\n\r\n\r\n\r\nCross-Section\r\n\r\n\r\n\r\n\r\n\r\n\r\nConveyance\r\n\r\n\r\n\r\n\r\n\r\n\r\nFrugal Scenario\r\nThe “Frugal” scenario can mimic the “Simple” conveyance curve and remove the negative spike that happens at \\(4 \\leq y \\lesssim 4.4\\) . The difference of maximum conveyance is negligible, being approximately 0.1% larger. This scenario has solved the problems on the “Simple” scenario with an insignificant increase in the cross-section conveyance.\r\nSuper scenario\r\nThis scenario has an additional panel marker at the bottom left part of the channel. The conveyance curve is shifted to the right (more conveyance) for any water depth \\(1 \\lesssim y \\lesssim 5\\). Hence, the cross-section is potentially carrying more flow than the “Simple” or “Frugal” scenario for those depths. Although, for water depths of \\(y > 5\\) the conveyance curve of this scenario gets close to the previous scenarios.\r\nThe difference of maximum conveyance is negligible but larger than in the “Frugal” scenario, being larger than 1%.\r\nEvery Scenario\r\nThe conveyance plot of the “Every” scenario is absurdly different to any other scenario. The cross-section conveyance has increased an 85%. This scenario almost duplicates the amount of flow the cross-section can convey at any given depth. This situation is produced by the combination of a vertical wall on the right bank with a panel marker on each extreme. The two conditions have eliminated the roughness influence of the wall.\r\nThe conveyance of a panelled section is calculated by the sum of the conveyances.\r\n\\[\r\n  K = \\sum_{i=1}^n{k_i} = k_1+k_2+k_3+k_4+k_5\r\n\\]\r\nHowever, in our case, the conveyance of the vertical wall (\\(k_5\\)) is going to be always 0. The conveyance is defined as \\(\\frac{1}{n} \\cdot R_h ^\\frac{2}{3} \\cdot A \\cdot S^\\frac{1}{2}\\) but the area \\(A\\) of a vertical section is always 0, independently of its depth. Indeed, we have created a “magical” frictionless wall duplicating the amount of flow that the cross-section can carry.\r\nAlthough this case has been created artificially to show the danger of inappropriate panelling. This situation can happen in a real-life cross-section. Be mindful with those cross-sections that have a vertical concrete wall, as setting a panel marker on each extreme of the wall will “remove it”, providing completely unrealistic effects.\r\nCase 2: Trapezoidal cross-section\r\nThe cross-section is a symmetrical trapezoid. A trapezoidal cross-section does not require any panel marker as its conveyance curve will not present any spikes. However, we will introduce them to see how the conveyance curve gets influenced by the introduction of unnecessary panel markers. In addition to the “Bed” and “Every” scenarios, we are modelling scenarios BA, BB and BC, by placing one additional panel marker5 at different locations. Scenarios BD and BE will have more than one panel marker.\r\n\r\n\r\n\r\n\r\n\r\nSimple\r\n\r\n\r\n\r\n\r\nFigure 5: Case 2, Trapezoidal section\r\n\r\n\r\n\r\n\r\n\r\nDifferences\r\n\r\n\r\nConveyance difference compared against Simple scenario.\r\n    \r\n      Max K [m³/s]\r\n      Difference [m³/s]\r\n      Difference %\r\n    Simple\r\n4402.178\r\n0.000\r\n0.000BA\r\n4677.494\r\n275.316\r\n6.254BB\r\n4505.396\r\n103.218\r\n2.345BC\r\n4413.395\r\n11.217\r\n0.255BD\r\n4718.288\r\n316.110\r\n7.181BE\r\n4866.107\r\n463.929\r\n10.539Bed\r\n5201.228\r\n799.050\r\n18.151Every\r\n5373.643\r\n971.465\r\n22.068\r\n\r\n\r\n\r\nCross-Section\r\n\r\n\r\n\r\n\r\n\r\n\r\nConveyance\r\n\r\n\r\n\r\n\r\n\r\n\r\nBA, BB and BC scenarios\r\nThe key information on these scenarios is that adding any6 panel marker has increased the conveyance. In symmetric shapes, the closer that the panel marker is to the symmetry axis, the less influence it has.\r\nWhen adding panel markers into cross-sections that do not need them, the roughness is decreased and consequently, the conveyance is increased.\r\nBD and BE scenarios\r\nAdding more panel markers increases the conveyance of the cross-section considerably. BD with 2 panel markers obtains a 7% difference, and BE with 3 panel markers obtains a 10.5% difference.\r\nBed scenario\r\nThe “Bed” scenario increases significantly its conveyance (18%). The conveyance has been increased for a whole range of depths as the panel marker are placed at low elevation levels. Therefore, the modeller should be extra careful when panel markers are placed at bed levels. Not only decreases the roughness of the cross-section, but it does for a large range of depth values.\r\nThe Bed scenario is equivalent to running the “Simple” scenario with a Manning’s n value of 0.0296 instead of the 0.0350 used in all scenarios7.\r\nEvery scenario\r\nThe “Every” scenario has increased the conveyance by 22%. The Bed scenario is equivalent8 to running the “Simple” scenario with a manning’s n value of 0.0287 instead of the 0.0350 used in these scenarios.\r\nCase 3: Cross-section with manmade wall\r\nIn this study case, a real-life cross-section has been used. The cross-section presents a set of structures on both sides, but the ones on the right bank are more pronounced. The cross-section’s conveyance curve presents two conveyance spikes, the first one near 9m, and the second one at 11.5m. Both spikes can produce stability issues. Usually, panel markers need to be located at the same height that spike occurs to remove it.\r\n\r\n\r\n\r\n\r\n\r\nSimple\r\n\r\n\r\n\r\n\r\nFigure 6: Case 3, Cross-section with manmade wall\r\n\r\n\r\n\r\n\r\n\r\nDifferences\r\n\r\n\r\nConveyance difference compared against Simple scenario.\r\n    \r\n      Max K [m³/s]\r\n      Difference [m³/s]\r\n      Difference %\r\n    Simple\r\n40590.86\r\n0.000\r\n0.000Single\r\n45531.98\r\n4941.114\r\n12.173Frugal\r\n46356.79\r\n5765.925\r\n14.205Over\r\n47279.61\r\n6688.743\r\n16.478Super\r\n49386.63\r\n8795.771\r\n21.669Bed\r\n47696.99\r\n7106.127\r\n17.507Every\r\n50247.37\r\n9656.503\r\n23.790\r\n\r\n\r\n\r\nCross-Section\r\n\r\n\r\n\r\n\r\n\r\n\r\nConveyance\r\n\r\n\r\n\r\n\r\n\r\n\r\nSingle\r\nThe “Single” scenario has only one panel marker located at the bottom of the wall. This action has removed all the spikes of the conveyance plot, and also is the scenario with the smaller difference, 12%. However, is not always practical to fiddle with the cross-section to solve all spikes with only one panel marker9.\r\nFrugal\r\nThis scenario uses 2 panel markers, one on the left side at 9m and one on the right at 11.5m. The larger spike that happens at 11.5m has been removed, but the use of only one panel marker on the left at 9m is not enough to remove the smaller spike. The conveyance difference is larger than in the “Single” scenario, being 14% larger.\r\nOver\r\nIn the “Over” scenario, we fix the smaller spike of the frugal scenario by adding a third panel marker on the right side at 9m. This produces a continuously growing well-behaved conveyance curve, at a price of a 16.5% increase on the conveyance. This is 2.5% larger than the “Frugal” scenario.\r\nSuper\r\nThe “Super” scenario contains several panel markers at different locations. They have been placed more randomly than with logic. It has managed to remove any spike from the conveyance plot, with an increase of 21%, the second-largest, just behind the “Every” scenario. This proves that with enough panel markers we can remove any negative spike, at a price of decreasing the roughness of the cross-section.\r\nBed\r\nThe “Bed” scenario uses panel markers to divide the bed from the walls, it increases the max conveyance by 17.5% which does not differ much from the “Over” scenario. But unlike the “Over” scenario, it is also unable to remove the largest spike.\r\nEvery\r\nThe “Every” scenario increases the conveyance a 23.8% when compared against the “Simple” scenario.\r\nCase 4: Cross-section with undeveloped floodplain\r\nThis cross-section has surveyed the main channel and a small part of the floodplain. The conveyance curve increases until reaching a water level of 39m, after that the conveyance gets more or less stuck in a set of spikes around 7500 m³/s. This situation occurs when the water level reaches an elevation of 39m or more.\r\nThe best option would be to trim the cross-section to the embankments (Ch: 28 - 96m) or include the missing part of the floodplain into the cross-section. By trimming we will be avoiding the extra area we will obtain once we apply the panel markers that inevitably would increase the conveyance over the 7500 m³/s value.\r\n\r\n\r\n\r\n\r\n\r\nSimple\r\n\r\n\r\n\r\n\r\nFigure 7: Case 4, Cross-section with undeveloped floodplain\r\n\r\n\r\n\r\n\r\n\r\nDifferences\r\n\r\n\r\nConveyance difference compared against Simple scenario.\r\n    \r\n      Max K [m³/s]\r\n      Difference [m³/s]\r\n      Difference %\r\n    Simple\r\n7799.11\r\n0.000\r\n0.000Frugal\r\n10187.36\r\n2388.253\r\n30.622Super\r\n10821.58\r\n3022.474\r\n38.754Bed\r\n10346.54\r\n2547.433\r\n32.663Every\r\n11022.44\r\n3223.326\r\n41.329\r\n\r\n\r\n\r\nCross-Section\r\n\r\n\r\n\r\n\r\n\r\n\r\nConveyance\r\n\r\n\r\n\r\n\r\n\r\n\r\nFrugal\r\nIn cross-sections that are oddly shaped like this one, adding panel markers will remove the conveyance quirkiness produced by the strange geometric shape. But by doing so, we are increasing the area available and removing the macro-roughness of the cross-section. This is why trimming is a good option that removes conveyance problems without increasing the conveyance.\r\nThe “Frugal” option increases the conveyance a 30%.\r\nSuper\r\nThis scenario adds a few more panel markers, it increases the conveyance a 38.7%.\r\nBed\r\nThe “Bed” scenario manages to remove all the spikes with an increase in the max conveyance of 32%. This is a very similar figure to the “Frugal” scenario. I am usually opposed to panelling at bed levels, but I have to admit that in this case it does not really influence the results that much. Still we are shifting the conveyance curve to the right for a large range of depths, but this shift is rather small.\r\nThe roughness decrease of panelling is equivalent10 to using a manning value of 0.024 on the simple section, instead of the 0.035 used on all scenarios.\r\nEvery\r\nThis scenario increases its conveyance a 41%. The roughness decrease of panelling is equivalent11 to using a manning value of 0.020 on the simple section, instead of the 0.035 used on all scenarios.\r\nCase 5: Large cross-section\r\nIn this case, a rather large cross-section from the Bald Eagle Creek is analysed. The data has been transformed from feet to meters. Given the size of the cross-section, the typical scenarios are not used. Instead, the modelled scenarios are EA (Panel markers around both channels), EB (Panel markers around 200m), EC (Panel markers at a high point located below 190m), Bed and Every.\r\nWhen analysing a large cross-section, it is important not to lose the bigger picture. The cross-section is 30m tall. In reality, even during an extreme flood event, it is very rare to find a water depth larger than 10 meters. Therefore, the modeller has to be mindful when checking the maximum conveyance over a certain value of stage as it might not be representative of any real situation.\r\nFor this reason, the cross-section has been trimmed at 195m, which still is a rather large cross-section. The tabs for the trimmed plot and difference have been added.\r\n\r\n\r\n\r\n\r\n\r\nPlot\r\n\r\n\r\n\r\n\r\nFigure 8: Case 5, Large Cross-Section\r\n\r\n\r\n\r\n\r\n\r\nDiff.\r\n\r\n\r\nConveyance difference compared against Simple scenario.\r\n    \r\n      Max K [m³/s]\r\n      Difference [m³/s]\r\n      Difference %\r\n    Simple\r\n5556588\r\n0.00\r\n0.000EA\r\n5635338\r\n78749.46\r\n1.417EB\r\n6004320\r\n447732.12\r\n8.058EC\r\n5800060\r\n243471.75\r\n4.382Bed\r\n5842425\r\n285837.01\r\n5.144Every\r\n6197115\r\n640526.54\r\n11.527\r\n\r\n\r\n\r\nXS.csv\r\n\r\n\r\n\r\n\r\n\r\n\r\nK.csv\r\n\r\n\r\n\r\n\r\n\r\n\r\nPlot (Tr)\r\n\r\n\r\n\r\n\r\nFigure 9: Case 5, Trimmed Large Cross-Section\r\n\r\n\r\n\r\n\r\n\r\nDiff. (Tr)\r\n\r\n\r\nConveyance difference compared against Simple scenario.\r\n    \r\n      Max K [m³/s]\r\n      Difference [m³/s]\r\n      Difference %\r\n    Simple\r\n394299.9\r\n0.00\r\n0.000EA\r\n428926.2\r\n34626.31\r\n8.782EC\r\n418501.0\r\n24201.09\r\n6.138Bed\r\n427647.4\r\n33347.46\r\n8.457Every\r\n446181.8\r\n51881.85\r\n13.158\r\n\r\n\r\n\r\nEA Scenario\r\nThis scenario is the closest one to the “Frugal” scenarios. This scenario with a panel marker at each side of the two main channels seems to behave well at the full cross-section (1.47%), however when the cross-section has been trimmed this scenario provides almost a 9% difference on the conveyance. It might not look that much but keep in mind that the simple scenario does not present any negative spikes and panel markers are not needed.\r\nEB Scenario\r\nThis scenario is only appreciated on the full cross-section as the panel markers have been placed over the trimmed section. It increases the cross-section by a significant 8%.\r\nEC Scenario\r\nThis scenario places panel markers at the high points located below 190m. It tries to represent a situation that I have seen frequently. For example, you have a floodplain consisting of grass with few bushes and a forest section. Then the modeller decides to divide each section with panel markers and assign a different n value for each section.\r\nI have not been able to find a term for this situation so I called it “micro-assignation of n Manning’s” or in short “micro-n-assignation”12.\r\nIn this example, the panel markers have been added to divide different sections of the flood plain, however, in this case, the manning n value remains 0.035 across the channel.\r\nOnly adding the panel markers have increased the conveyance13 by a 6%. The modeller should keep this in mind when selecting different roughness for each section.\r\nBed\r\nThis scenario produces results very alike to scenario EA (8.5%) in the trimmed section, on the whole cross-section the influence is larger (5%).\r\nEvery\r\nThe “Every” scenario shows the largest difference, 12% larger than the “Simple” scenario on both trimmed and non-trimmed cross-section.\r\nConclusions\r\nIt is not an easy task to conclude a study using only a few cases, especially when the outcomes depend heavily on the unique cross-section shape.\r\nWe can confirm that adding a panel marker always reduces the roughness of the cross-section, allowing more water to be conveyed downstream. This situation can be appreciated in all cross-sections but it is especially visible in case 2. Adding panel markers is equivalent to reducing the Manning’s n value of the cross-section.\r\nThis has a second connotation if the modeller is performing “micro-n-assignations”14 within the cross-section. Flood Modeller’s warning W2044 might suggest entrapping those values (the micro-assignations) within panel markers. The modeller has to be especially careful when following this warning. The mere act of entrapping a zone of the cross-section will reduce the roughness of the cross-section as a whole, and might be necessary to revise the Mannings’ n values used are (still) achieving what it is intended. The modeller can assign the Mannings’ n values and ignore the warning 15 or alternatively, I would suggest avoiding “micro-n-assignation” at all16.\r\nWe can also confirm that for any given configuration of panel markers, adding a panel marker will impact its conveyance. However, when the configurations of panel markers are different (they are placed at other locations like Case 4 Bed versus Super), it is not possible to know (beforehand) what configuration produces a larger increase in conveyance based on the number of panel markers.\r\nThe modeller should not forget that panelling is a powerful tool to remove conveyance problems, but it is not the only one. In certain cases, trimming the unused parts of a cross-section, connecting bank channels to something else such as floodplain units, reservoir units or 2d areas can solve the problem.\r\nFinally, the last conclusion is that a panel marker only influences the conveyance curve for water levels higher than its location. This means that higher panel markers are desirable because they keep the conveyance curve unaltered for the lower water depths.\r\nDisclaimer\r\nThis article has not been peer-reviewed. The author assures that the utmost care has been taken to ensure the accuracy of the content. However, errors may occur, if you found any, please report it to the author’s via Linkedin.\r\n\r\n\r\n\r\nCharpentier, Osmand E. 2018. “MANNING FORMULA DEMONSTRATION.” Osmand Charpentier, January. https://www.academia.edu/37869711/MANNING_FORMULA_DEMONSTRATION.\r\n\r\n\r\nChow, Ven Te. 1985. Open-Channel Hydraulics: International Student Edition. 21st print. McGraw-Hill Civil Engineering Series. Auckland: McGraw-Hill.\r\n\r\n\r\nFlood Modeller Team. n.d. “Conveyance and Cross-Section Property Display.” Accessed December 21, 2021. http://help.floodmodeller.com/floodmodeller/Technical_Reference/1D_Nodes_Reference/Rivers/Conveyance_and_Cross-Section_Property_Display.htm.\r\n\r\n\r\nGoodell, Chris. 2017. “Back to the Basics: Bank Station Placement - Kleinschmidt.” The RAS Solution. https://www.kleinschmidtgroup.com/ras-post/back-to-the-basics-bank-station-placement/.\r\n\r\n\r\nUSACE Hydrologic Engineering Center. n.d. “Cross Section Subdivision for Conveyance Calculations.” HEC-RAS Hydraulic Reference Manual. Accessed December 23, 2021. https://www.hec.usace.army.mil/confluence/rasdocs/ras1dtechref/theoretical-basis-for-one-dimensional-and-two-dimensional-hydrodynamic-calculations/1d-steady-flow-water-surface-profiles/cross-section-subdivision-for-conveyance-calculations.\r\n\r\n\r\nI have called them spikes because they remind me of dragon spikes, but Flood Modeller refers to them as negative conveyance.↩︎\r\nThe instabilities are produced because the solver will eventually jump from one stage value to the other. This generates a wave that propagates downstream.↩︎\r\nSometimes called smooth conveyance curve.↩︎\r\nI think a lot of people are misled by Flood Modeller’s Warning 2044, combined with micro-assignation of n values to a cross-section instead of assigning “global” values.↩︎\r\nClick on the plot’s legend to activate/deactivate the location of the panel parkers.↩︎\r\nThe only exception is adding a panel marker on the symmetry axis.↩︎\r\nComparison only valid at the maximum stage.↩︎\r\nComparison only valid at the maximum stage.↩︎\r\nIt is also not always possible either. In this case, it has been achieved because placing the panel marker at the bottom of the wall removes the friction of the wall (8.93 and 7.23) that removes the first spike. The second spike is removed because the left zone weights more than the right, so the right is unable to produce a spike. But if you zoom at 11.5m you can see how the conveyance has a (positive) quirkiness.↩︎\r\nComparison only valid at the maximum stage.↩︎\r\nComparison only valid at the maximum stage.↩︎\r\nMicro-n-assignation is the name I have given when a modeller uses precise manning values across the channel as opposed to using one global n manning value for the channel, another for the left floodplain and another value for the right floodplain. Limiting the cross-section to 3 different n values.↩︎\r\nOr reduced the roughness↩︎\r\nMicro-n-assignation is the name I have given when a modeller uses precise manning values across the channel as opposed to using one global n manning value for the channel, another for the left floodplain and another value for the right floodplain. Limiting the cross-section to 3 different n values.↩︎\r\nThis is, not entrapping the areas with different manning in between panel markers.↩︎\r\nI would suggest using the full range of n values on the (Chow 1985) tables. Use a value located in between the minimum and normal bracket if the cross-section has features that decrease the roughness (v.g. concrete walls) and values located between maximum and normal bracket if the cross-section has features that increase the roughness (v.g. a tree).↩︎\r\n",
    "preview": "posts/2021-12-24-an-analysis-of-the-effects-of-panel-markers-on-a-cross-sections-conveyance-curve/images/preview.png",
    "last_modified": "2024-07-27T01:47:32+01:00",
    "input_file": {},
    "preview_width": 799,
    "preview_height": 567
  },
  {
    "path": "posts/2021-08-21-linear-and-bilinear-interpolation-in-excel/",
    "title": "Linear and bilinear interpolation in Excel",
    "description": "An excel template to search in a table of values for certain item, and if it doesn't exist, then performs a linear intepolation between the 2 closest values.",
    "author": [
      {
        "name": "Ricardo Montero Rubert",
        "url": "https://blog.rmrubert.eu/about"
      }
    ],
    "date": "2021-08-21",
    "categories": [],
    "contents": "\r\nTL;DR: Quick Download of Excel template.\r\nDo you often need to do linear interpolation in Excel from a table of values? Does it bother you a hell of a lot that some people choose a value in between instead of doing a linear interpolation? Do you like having intricate formulas in your Excel that nobody else know what they do? Do you want to become an Excel Wizard?\r\n\r\n\r\n\r\nFigure 1: Screenshot of the template\r\n\r\n\r\n\r\nAny sensible person would have replied Yes to the last three questions. However, only people working in (Civil) Engineering reply Yes to the first question. Why? You would ask. Well, because in Civil Engineering (and its associated branches like hydraulic, Geotech, etc…) we have accepted that the world is not ruled by formulas, but from a set of empiric values done in a study on the XX or the XIX century. Those studies drew their conclusions in the form of a graphical table, a numerical table or if we were lucky, a statistical regression formula that fit the original data fairly well.\r\nAnd because I was pissed off with the table/figure looking to retrieve values I decided to create an excel able to do so automatically for me. And here it is the definitive1 Excel to perform Linear Interpolation (single entry tables) and Bilinear Interpolation (Double entry tables). You can download it from here , or keep reading to know more about how it works.\r\nLinear Interpolation\r\nIt would be great if Excel had a linear interpolation function, but it doesn’t. Excel has the =FORECAST.LINEAR(X,knownY,knownX) function. But this formula will use the whole set of data to create a linear regression model. This is not what we want.\r\n\r\n\r\n\r\nFigure 2: A typical linear regression model that could be seen in some articles.\r\n\r\n\r\n\r\nSo to work as we want, we need to filter it. We use the =OFFSET() and =MATCH() functions to select only a pair of points. After filtering, we have only 2 points, and a linear regression model of two points is indeed a linear interpolation2.\r\nThe formula used is below, remind to delete all new lines if you copy and paste it.\r\n    =FORECAST.LINEAR(<X>,OFFSET(<headerX>,MATCH(<X>,<knownXrange>,1),\r\n      <columnknownY>,2,1),OFFSET(<headerX>,MATCH(<X>,<knownXrange>1),0,2,1))\r\nWhere:\r\n<X> is the cell of the x value we need to guess,\r\n<headerX> is the column name of the known X values,\r\n<knownXrange> is the range of the known X values, and,\r\n<columnknownY> is an integer number of where the known Y values are located. If they are the next (➡) column to X it will be 1. Two columns to the right = 2, etc…\r\nThere is an additional use, you can use this formula to convert any set of values into an equally spaced (in X) set of values. If you do so, be careful as the local and global extreme values will be removed.\r\nBilinear Interpolation\r\nI also have added a bilinear interpolation. Bilinear interpolation might not be as intuitive as linear interpolation. A quick read to this Wikipedia Article might be helpful, alternatively, you can look at the image below from the very same article. As you can see, one needs to perform 3 linear interpolations with the data on the table to get the required result.\r\n\r\n\r\n\r\nFigure 3: Comparison of Bilinear interpolation with some 1- and 2-dimensional interpolations\r\n\r\n\r\n\r\nOn my Excel template, I have done this in 2 different ways. The first way, I use an auxiliary table. In this table, the 4 values are identified using the offset and match functions. Then the 3 linear interpolations are performed using the =FORECAST.LINEAR() function and voilà! we have our result. This solution is neat, easily auditable but takes space, exactly 3x2 cells for the auxiliary table.\r\nThere is another solution that is to use the following formula from the aforementioned wiki article:\r\n\\[\r\nf(x, y) = a_{00} + a_{10}x + a_{01}y + a_{11}xy\r\n\\]\r\nWhere:\r\n\\(a_{00} = f(0, 0)\\),\r\n\\(a_{10} = f(1, 0) - f(0, 0)\\),\r\n\\(a_{01} = f(0, 1) - f(0, 0)\\), and,\r\n\\(a_{11} = f(1, 1) - f(1, 0) - f(0, 1) + f(0, 0)\\).\r\nWhich when translated to Excel become this monster (I have divided into lines for clarity, remove them before using in Excel):\r\n=OFFSET(<topleftTableHeader>,MATCH(<Y>,<knownY>,1),MATCH(<X>,<knownX>,1),1,1)+\r\n (OFFSET(<topleftTableHeader>,MATCH(<Y>,<knownY>,1),MATCH(<X>,<knownX>,1)+1,1,1)-\r\n OFFSET(<topleftTableHeader>,MATCH(<Y>,<knownY>,1),MATCH(<X>,<knownX>,1),1,1))*<X>+\r\n (OFFSET(<topleftTableHeader>,MATCH(<Y>,<knownY>,1)+1,MATCH(<X>,<knownX>,1),1,1)-\r\n OFFSET(<topleftTableHeader>,MATCH(<Y>,<knownY>,1),MATCH(<X>,<knownX>,1),1,1))*<Y>+\r\n (OFFSET(<topleftTableHeader>,MATCH(<Y>,<knownY>,1)+1,MATCH(<X>,<knownX>,1)+1,1,1)-\r\n OFFSET(<topleftTableHeader>,MATCH(<Y>,<knownY>,1),MATCH(<X>,<knownX>,1)+1,1,1)-\r\n OFFSET(<topleftTableHeader>,MATCH(<Y>,<knownY>,1)+1,MATCH(<X>,<knownX>,1),1,1)+\r\n OFFSET(<topleftTableHeader>,MATCH(<Y>,<knownY>,1),MATCH(<X>,<knownX>,1),1,1))*<X>*<Y>\r\nWhere:\r\n<X> is the cell of the X value we need to guess,\r\n<Y> is the cell of the Y value we need to guess,\r\n<knownX> is the range of the known X values (X values have to go from left to right),\r\n<knownY> is the range of the known Y values (Y values have to go from top to bottom), and,\r\n<topleftTableHeader> is the top-left header of the table with the data.\r\nThis solution is a nightmare to audit but hey, it takes only one cell!\r\nDon’t forget to download the excel.\r\nAcknowledgments\r\nFigure 3 is from Cmglee, CC BY-SA 4.0.\r\n\r\nDefinitive because I don’t think I will update it any time soon.↩︎\r\nIt is also a rubbish regression model, but that is none of our business.↩︎\r\n",
    "preview": "posts/2021-08-21-linear-and-bilinear-interpolation-in-excel/images/Excel_Inter_01.png",
    "last_modified": "2021-11-16T22:07:15+00:00",
    "input_file": {},
    "preview_width": 1052,
    "preview_height": 848
  },
  {
    "path": "posts/2021-06-27-tic-tac-toe-in-fortran90/",
    "title": "Tic Tac Toe in Fortran90",
    "description": "In this post, I analyse the first comprehensive program I have ever created: A Tic-Tac-Toe game designed in Fortran90 to play against the computer! And the challenges that I had to face to make it work.",
    "author": [
      {
        "name": "Ricardo Montero Rubert",
        "url": "https://blog.rmrubert.eu/about"
      }
    ],
    "date": "2021-06-27",
    "categories": [],
    "contents": "\r\nI was discussing with a friend the differences between a machine learning algorithm and a parrot🦜1. The conversation pivoted into artificial intelligence and how once I created a program able to play Tic-Tac-Toe.\r\nTL;DR: Quick Download of Fortran90 code.\r\nI thought it could be an exciting topic for this blog. So today’s post is about how did I create a program that can play Tic-Tac-Toe. I did this program a long time ago. I was studying my first year of Civil Engineering for the module introduction to coding. Introduction to coding taught us how to code problems using our old friend Fortran90.\r\nI start looking through back-ups and a little bit after I found the original code I wrote. The code has all the comments in Spanish. To be fair, the comments themselves could be another post on their own.\r\n\r\n\r\n\r\nFigure 1: Screenshot of the game.\r\n\r\n\r\n\r\nI am publishing the code (at the end of the post) as I found it in the backup. Well, almost exactly. I have changed the array constructor. I was using [A,B] (Fortran 2003 standard) instead of (/A,B/) (Fortran90 standard), and apparently, that was making that Fortran PowerStation 4 couldn’t compile the code.\r\nI have tested the code and I can guarantee that gfortran, Fortran PowerStation 4 and Silverfrost FTN95 can compile it. Although the Silverfrost FTN95 executable can’t run successfully2 on windows 10.\r\n\r\n\r\n\r\nFigure 2: Flowchart of how the game works.\r\n\r\n\r\n\r\nAs the flow chart shows, the code is very simple:\r\n+ it asks you if you want to start\r\n+ in the human’s turn, it asks to introduce a pair of integer separated by a comma: row, column\r\n+ in the computer’s turn,\r\n- it tries to win, if not\r\n- it tries not to lose, if not\r\n- computes the best position and place the token there\r\nHuman always plays with circles, the computer plays with crosses. The board is formed by a 3x3 array of integers. If there is no token in a position, that position contains a 0. If the human places a token, the position’s value is updated with a 1. If it is the computer that places a token, that position’s value is updated with 4.\r\n\r\n\r\n\r\nFigure 3: Example of how the algorithm sees the board and the RCD vector.\r\n\r\n\r\n\r\nWhy ones and fours? As the board is 3x3, I can compute the sum of every row (S1, S2, S3), every column (S4, S5, S6) and every diagonal (S7, S8). We call this vector with the Sums of every Row-Col-Diag, RCD sum vector. RCD is called SS (Sumas del Sistema) in the code, remind the code is in Spanish. RCD is what the computer uses to know how the game is going.\r\nIf at the computer’s turn, any RCD value (S1 - S8) is eight. The algorithm sees there is a possible victory. Similarly, if any RCD value is two, the computer knows that its opponent could win in the next turn. In the same way, if any RCD value is 3 or 12, then somebody has won and the game is over.\r\n\r\n\r\n\r\nFigure 4: The RCD sum vector is used to check the board status.\r\n\r\n\r\n\r\nWhat is more tricky is to figure out where to place when there is no possibility to immediately win or lose. If you take the time to read the code (which nobody will do because ain’t nobody got time for that) you will notice that I created two subroutines to deal with this situation. You could use one or another by commenting/uncommenting lines 197/198.\r\nThe first subroutine is called MJ() (it stands for Mejor Jugada, which means the best move in Spanish). MJ() was my first attempt at solving this problem. It does several things wrongly. MJ() works by giving a score to each cell based on the even values of the RCD vector. Odd values are penalised because they contain an enemy token.\r\nWhat is wrong with MJ()?\r\nWell, it is unable to predict if a cell has more chances to win than another.\r\nPlus, it uses the Fortran90 function maxloc() to retrieve the max score. The maxloc() will return only the first max found (if there are several).\r\nThe combination of both errors lets the user hoodwink the computer if it permits the computer to start. If the computer starts, then the scoreboard is empty. Hence, the algorithm always places its first token at [1,1]. If the user plays their token following the sequence of [3,3] - [3,1] - [1,3] it will result in the user winning. Letting humans win is not how Skynet will take control of the world.\r\nSubroutine MJ() was rubbish, but it had some part to play in it, for good or evil, any future function must prioritise cells with more win conditions even with an empty board. So IA() was born.\r\n\r\n\r\n\r\nFigure 5: Example of how the IA() function calculates the score to place a token\r\n\r\n\r\n\r\nIA() gets the matrix board, and a computer’s token (a 4 value) is placed wherever there is an empty space. Then it computes a new RCD vector to this matrix board. Any cell can be a participant of 0 to 2 victories, corners’ cells can obtain a max score of 3, whilst the central cell could reach a max score of 4.\r\nIn other words, IA() draws the available lines to win on the board (using maths). Then it places the token at the cell with more lines crossing. End. I haven’t been able to win to this system. Fortunately for us, the world’s fate between humanity and Skynet will not be decided in a Tic-Tac-Toe game.\r\nTo conclude, you can click on the links below to download the code (TicTacToe.f90). Alternatively, if you are senseless enough to execute random programs you find on the interweb, I got your back too! The compiled executable is available(TicTacToe.exe.7z), and I even got you the VirusTotal report.\r\nDownload Section\r\nDownload the code: TicTacToe.f90\r\nDownload the executable: TicTacToe.exe.7z\r\nThe code\r\nprogram tt\r\nImplicit none\r\nInteger, dimension(3,3)::tablero=0\r\nInteger,dimension(2):: loc=(/0,0/)\r\nInteger:: i,j,k !auxiliares\r\nInteger:: n=1, theta=0\r\nLogical:: cw=.false.,hw=.false.  !cw= computer wins, hw = Human wins\r\ncharacter:: sel=\"w\"\r\n!Descomentar y cambiar para trucar el juego !Util para hacer debug\r\n!tablero(1,1:3)=(/0,0,0/)\r\n!tablero(2,1:3)=(/0,0,0/)\r\n!tablero(3,1:3)=(/0,0,0/)\r\nPrint*, \"#######################\"\r\nPrint*, \"# Juego de 3 en linea #\"\r\nPrint*, \"#   Ricardo Montero   #\"\r\nPrint*, \"#######################\"\r\nDo\r\n  Do while (.not.(sel == \"s\" .or. sel == \"S\" .or. sel == \"n\" .or. sel==\"N\"))\r\n    Print*, \"Quieres empezar tu? [S/N]\"\r\n    Read*, sel\r\n    If (sel == \"s\" .or. sel == \"S\") n=2\r\n  enddo \r\n  !Empieza el juego\r\n  DO while (theta /=9)\r\n    ! Selecciona al que le toca jugar, un numero 'n' par indica turno humano, un numero 'n' impar indica turno ordenador\r\n    If (mod(n,2)==0) then\r\n      !Juega humano\r\n      Do !CENTINELA, sin el puede haber problemas\r\n        Print*, \"Introduce donde vas a colocar. [F,C]\"\r\n        Read*, loc\r\n        If (tablero(loc(1),loc(2))==0) then\r\n          exit \r\n        else\r\n          Print*, \"Selecciona un sitio correcto\"\r\n        endif\r\n      enddo\r\n      !La función colocar devuelve el tablero con la nueva dicha del jugador 'n', colocada en la posición loc.\r\n      tablero=colocar(tablero,loc,n) \r\n    else\r\n      !juega maquina.\r\n      !Se llama a la subrutina pensamiento crítico 'pc' y esta decide entre que escoger.\r\n      !La prioridad de la maquina es ganar, su segunda prioridad es no perder bajo ningun concepto\r\n      !Su ultima prioridad es colocar la ficha en el lugar donde hay mayores combinaciones en\r\n      !el caso de que pudiera poner tantas fichas como quisiera. (Es un poco liosa está ultima)\r\n      Print*, \"Turno del ordenador\"\r\n      call pc(tablero,loc)\r\n      tablero=colocar(tablero,loc,n)\r\n    endif\r\n    theta=theta+1 !Si se hacen 9 movimientos, que son los máximos que permite el tablero, se sale del bucle.\r\n    n=n+1 !Avanza un turno.\r\n    Print*, \"\"\r\n    call mostrar(tablero) !Está función muestra el tablero tal y como se encuentra, el ordenador juega con 4, y el humano con 1\r\n    Print*, \"\"\r\n    !Al final de cada jugada se comprueba si alguien ha ganado, se hace sumando, si se suma 12 o 3 es que se ha hecho linea.\r\n    Call check(tablero,cw,hw)\r\n    !Si gana alguno, se sale del DOWHILE antes de tiempo\r\n    If (cw) then\r\n      theta=9 !Se fuerza la salida\r\n      Print*, \"Gana la maquina\"\r\n    elseif (hw) then\r\n      theta=9 !Se fuerza la salida\r\n      Print*, \"Gana el humano\"\r\n    Elseif (theta==9) then\r\n      Print*, \"No gana nadie\"\r\n    endif\r\n  ENDDO\r\n  Print*, \"Deseas empezar otra partida?\"\r\n  Read*, sel\r\n  If (sel == \"s\" .or. sel == \"S\") then\r\n    sel=\"w\"\r\n    n=1\r\n    theta=0\r\n    tablero=0\r\n    loc=(/0,0/)\r\n  else\r\n    exit\r\n  endif\r\nenddo\r\nPause \"Pulse 'intro' para salir\"\r\n!###########!\r\ncontains\r\n!***************!\r\n!*** MOSTRAR ***!\r\n!***************!\r\nSubroutine Mostrar(fichas) !La funcion mostrar muestra el tablero. No tiene ningun misterio.\r\n  Integer, dimension (3,3):: fichas\r\n  Character, dimension(3,3):: tb\r\n  Integer:: i,j\r\n  Print*, \"+---+---+---+\"\r\n  Do i=1,3\r\n    Do j=1,3\r\n      If (fichas(i,j)==4) then\r\n        tb(i,j)=\"X\"\r\n      elseif (fichas(i,j)==1) then\r\n        tb(i,j)=\"O\"\r\n      else\r\n        tb(i,j)=\" \"\r\n      endif\r\n    enddo\r\n    Print*, \"| \",tb(i,1),\" | \",tb(i,2),\" | \",tb(i,3),\" |\"\r\n    Print*, \"+---+---+---+\"\r\n  enddo  \r\nendsubroutine\r\n\r\n!***************!\r\n!*** COLOCAR ***!\r\n!***************!\r\nfunction colocar(tab,loc,n) !Esta funcion detecta de quien es el turno, y donde hay que colocar. No se preocupa de si el tablero está vacio.\r\n  !Por ello son las funciones que usan esta quien deben evitar que se use una posición ocupada.\r\n  !Esto se hace así para evitar bucles de comprobación sobre si se ha puesto o no.\r\n  Integer,dimension(3,3)::tab, colocar\r\n  Integer,dimension(2)::loc\r\n  Integer::n\r\n  If (mod(n,2)==0) then\r\n    !Pone en el tablero 1, que es la marca del jugador\r\n    colocar=tab\r\n    colocar(loc(1),loc(2))=1\r\n  else\r\n    !Pone en el tablero 4, que es la marca del pc\r\n    colocar=tab\r\n    colocar(loc(1),loc(2))=4\r\n  endif\r\n\r\nendfunction\r\n!******************************!\r\n!***** HA GANADO ALGUIEN? *****!\r\n!******************************!\r\n!La función check comrpueba si ha ganado alguien. El juego ha sido pensado para que las sumas laterales den 3 o 12 si alguien ha ganado.\r\n!Es matematicamente imposible que se de una victoria sin estar en linea\r\n!Esta función permite que ambos jugadores ganen, pero el sistema por turnos evita esto, pues si ha ganado alguno\r\n!reinicia el programa.\r\nSubroutine check(T,a,z)\r\n  Integer,dimension(3,3)::T\r\n  Integer,dimension(8)::SS\r\n  Integer::i\r\n  Logical::a,z\r\n  a=.false.\r\n  z=.false.\r\n  SS(1)= Sum(T(1,:))          !\r\n  SS(2)= Sum(T(2,:))          !   4 5 6  8\r\n  SS(3)= Sum(T(3,:))          ! 1 # # #\r\n  SS(4)= Sum(T(:,1))          ! 2 # # #\r\n  SS(5)= Sum(T(:,2))          ! 3 # # #\r\n  SS(6)= Sum(T(:,3))          !              7\r\n  SS(7)= T(1,1)+T(2,2)+T(3,3)      !\r\n  SS(8)= T(3,1)+T(2,2)+T(1,3)      !\r\n  Do i=1,8\r\n    If (ss(i)==12) then\r\n      a=.true.\r\n    elseif (ss(i)==3) then\r\n      z=.true.\r\n    endif\r\n  enddo\r\nEndsubroutine\r\n!*******************************!\r\n!** PENSAMIENTO CRÍTICO  **!\r\n!*******************************!\r\n!Aquí está la madre del cordero.\r\n!Esta función comprueba primero si puede ganar colocando una ficha de manera inmediata.\r\n!Si esto no ocurre, comprueba si pueder evitar perder, colocando una ficha en una hilera en la que el oponente controlo dos casillas\r\n!Si ninguna anterior ocurre la función puede llamar a dos subfunciones, \"mejor jugada\" o \"inteligencia artificial\".\r\n!La primera es la versión antigua y la mantengo por curiosidad. A la segunda versión todavía no la he ganado.\r\nSubroutine pc(T,L)\r\n  Integer, dimension(3,3):: T\r\n  Integer, Dimension(2)::L\r\n  Integer, dimension(8):: SS\r\n  Integer:: i,nw,nl\r\n  Logical:: win, lose\r\n  Win=.false. ; nw=0\r\n  lose=.false. ; nl=0\r\n  !Calculamos el vector suma. \r\n  SS(1)= Sum(T(1,:))          !\r\n  SS(2)= Sum(T(2,:))          !   4 5 6  8\r\n  SS(3)= Sum(T(3,:))          ! 1 # # #\r\n  SS(4)= Sum(T(:,1))          ! 2 # # #\r\n  SS(5)= Sum(T(:,2))          ! 3 # # #\r\n  SS(6)= Sum(T(:,3))          !          7\r\n  SS(7)= T(1,1)+T(2,2)+T(3,3)              !\r\n  SS(8)= T(3,1)+T(2,2)+T(1,3)               !\r\n  Do i=1,8\r\n    If (SS(i)==8) then\r\n      win=.true.\r\n      nw=i\r\n    elseif (SS(i)==2) then\r\n      lose=.true.\r\n      nl=i\r\n    endif\r\n  enddo\r\n  If (win) then\r\n    !Buscar posición de ganador\r\n    L=ganar(T,nw)\r\n  elseif (lose) then\r\n    !Buscar posicion donde pierdes\r\n    L=ganar(t,nl)\r\n  else\r\n    !Nos toca pensar la mejor jugada\r\n    !L=MJ(T,SS) !Metodo Antiguo\r\n    L=ia(T,SS) !El sistema moderno\r\n  endif\r\nendsubroutine\r\n  !*************!\r\n  !**  GANAR  **!\r\n  !*************!\r\n  !La subfunción ganar, fue diseñada para buscar posibles victorias pero finalmente se utilizo para evitar posubles derrotas\r\n  !Tecnicamente deberia llamarse NoPerder\r\n  !Comprueba huecos vacios usando sumas parciales.\r\n  Function ganar(T,nw)\r\n    Integer, dimension(3,3)::T\r\n    Integer, dimension(2):: ganar\r\n    Integer::nw\r\n    ganar=(/0,0/)\r\n      If (nw<=3) then ! Analiza por filas\r\n        ganar=(/nw,minloc(T(nw,:))/)\r\n      elseif (nw<=6) then ! Analiza por columnas\r\n        nw=nw-3\r\n        ganar=(/minloc(T(:,nw)),nw/)\r\n      Elseif (nw==7) then !Analiza la diagonal 7, Izda,sup :: Dcha,inf\r\n        If (T(1,1)==0) then\r\n          ganar=(/1,1/)\r\n        elseif (T(2,2)==0) then\r\n          ganar=(/2,2/)\r\n        else\r\n          ganar=(/3,3/)\r\n        endif\r\n      else !Analiza la diagonal 8\r\n        If (T(1,3)==0) then\r\n          ganar=(/1,3/)\r\n        elseif (T(2,2)==0) then\r\n          ganar=(/2,2/)\r\n        else\r\n          ganar=(/3,1/)\r\n        endif\r\n      endif\r\n  endfunction\r\n  !**********************!\r\n  !**** MEJOR JUGADA ****!\r\n  !**********************!\r\n  !La función mejor jugada es el sistema antiguo de pensamiento. Esta decide cual es la mejor jugada.\r\n  !La mejor jugada es aquella en la que las lineas están compuestas en su totalidad por numeros pares y\r\n  !tienen sus sumas parciales más altas.\r\n  Function MJ(T,Ss)\r\n    Integer,dimension(3,3)::T, Naux\r\n    Integer,Dimension(2)::mj\r\n    Integer,dimension(8)::ss\r\n    Integer::i,j\r\n      Naux=0\r\n      ! Regeneramos el vector y le decimos que si la suma no es par, que no nos interesa poner ficha en esa linea(porque hay ocupación del enemigo).\r\n      !**Regenerando el vector\r\n      do i=1, 8\r\n        If (mod(Ss(i),2)/=0) ss(i)=0\r\n      enddo\r\n      !** Ahora calculamos la nueva matrix naux, está tiene la suma de las parciales del vector regenerado.\r\n      Do i=1,3\r\n        do j=1,3\r\n          Naux(i,j)=Naux(i,j)+ss(i)\r\n        enddo\r\n      enddo\r\n      Do i=1,3\r\n        do j=1,3\r\n          Naux(j,i)=Naux(j,i)+ss(i+3)\r\n        enddo\r\n      enddo\r\n      Do i=1,3\r\n        Naux(i,i)=Naux(i,i)+ss(7)\r\n        Naux(i,4-i)=Naux(i,4-i)+ss(8)\r\n      enddo\r\n      !** En este momento podemos tener seleccionado como maximo valor un lugar donde ya esté la posición ocupada,\r\n      !** Por ello vamos a darle el valor cero a esas posiciones con el siguiente algoritmo.\r\n      !** Comprueba si el tablero tiene un cero (sin ficha colocada) si no es así, se carga esa posición en naux\r\n      Do i=1,3\r\n        Do j=1,3\r\n          !El numero es negativo para que no existan problemas en la primera tirada donde el resto son ceros.\r\n          If (T(i,j)/=0) Naux(i,j)=-5\r\n        enddo\r\n      enddo\r\n      MJ=maxloc(naux) !Se asigna la mejor jugada\r\n      !Este sistema es vulnerable si empieza la maquina y pones en: 3,3 luego en 3,1 y por ultimo en 1,3\r\n      !Por eso fue sustituido por la inteligencia avanzada.\r\n  endfunction\r\n  \r\n  !*********************!\r\n  !*** IA  AVANZADA  ***!\r\n  !*********************!\r\n  !Este sistema lo que hace es coger el tablero y rellenar todos los huecos vacios posibles con 4\r\n  !Cuenta que casillas comparten más victorias y posibles lineas.\r\n  !Si una casilla con 4 provoca una victoria se le suma 1, si provoca 2 victorias se le suma 2 y así sucesivamente.\r\n  !Para entedernos, lo que hace es coger el tablero, y lo rellena con sus fichas.\r\n  !Acto seguida marca todas las posibles formas de victoria como si pintaras lineas encima del tablero\r\n  !Por ultimo cuenta las lineas que pasan por cada casilla. La que más tenga es la candidata.\r\n  !Hasta la fecha no he conseguido ganarle.\r\n  fUNCTION ia(T,SS)\r\n    Integer, dimension(3,3)::T,copy\r\n    Integer,Dimension(2)::IA\r\n    Integer,dimension(8)::SS\r\n    Integer,Dimension(6)::sv\r\n    Integer::i,j\r\n    copy=t\r\n    Do i=1,3\r\n      Do j=1,3\r\n        If(copy(i,j)==0) copy(i,j)=4\r\n      enddo\r\n    enddo\r\n    SS(1)= Sum(copy(1,:))          !\r\n    SS(2)= Sum(copy(2,:))          ! 7 4 5 6 8\r\n    SS(3)= Sum(copy(3,:))          ! 1 # # #\r\n    SS(4)= Sum(copy(:,1))          ! 2 # # #\r\n    SS(5)= Sum(copy(:,2))          ! 3 # # #\r\n    SS(6)= Sum(copy(:,3))          ! 8       7\r\n    SS(7)= copy(1,1)+copy(2,2)+copy(3,3)      !\r\n    SS(8)= copy(3,1)+copy(2,2)+copy(1,3)      !\r\n    copy=0\r\n    Do i=1,3\r\n      If (ss(i)==12) then\r\n        copy(i,:)=copy(i,:)+1\r\n      endif\r\n      If (ss(i+3)==12) then\r\n        copy(:,i)=copy(:,i)+1\r\n      endif\r\n    enddo\r\n    If (ss(7)==12) then\r\n      copy(1,1)=copy(1,1)+1\r\n      copy(2,2)=copy(2,2)+1\r\n      copy(3,3)=copy(3,3)+1\r\n    endif\r\n    If (ss(8)==12) then\r\n      copy(1,3)=copy(1,3)+1\r\n      copy(2,2)=copy(2,2)+1\r\n      copy(3,1)=copy(3,1)+1\r\n    endif\r\n    Do i=1,3\r\n      Do j=1,3\r\n        !El numero es negativo para que no existan problemas en la primera tirada donde el resto son ceros.\r\n        If (T(i,j)/=0) copy(i,j)=-5\r\n      enddo\r\n    enddo\r\n    ia=maxloc(copy)\r\n  endfunction\r\n!ENDCONTAINS\r\nendprogram\r\n\r\n.↩︎\r\nI blame the compiler.↩︎\r\n",
    "preview": "posts/2021-06-27-tic-tac-toe-in-fortran90/images/TTT-01.jpg",
    "last_modified": "2023-06-16T22:30:39+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-06-12-classifying-your-music-library-by-genre-using-r-and-lastfm-api/",
    "title": "How to classify your music collection by genre. The Ricardo approach.",
    "description": "I have tried to classify my music library by Genre. After several trials and errors with different software, I surrendered and went manual. You will read the problem I encountered, my initial approach and how I used R and last.fm API to help me circumscribing the multiple options.",
    "author": [
      {
        "name": "Ricardo Montero Rubert",
        "url": "https://blog.rmrubert.eu/about"
      }
    ],
    "date": "2021-06-12",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nWhy classifying by Genre is complicated.\r\nSoftware to auto-sort by Genre\r\nGetting philosophical about music classification\r\nLess philosophy and more coding!\r\n\r\n\r\n\r\n\r\nFigure 1: Musicbee after the Genre classification\r\n\r\n\r\n\r\nThis post is about how did I organise my music library by genre. I have not done it for the sake of organisation (well, maybe a little), but because it is part of a bigger project. This (bigger) project is to have an old radio reconverted with a Raspberry PI in such a way that turning the dial will let the user choose different radio stations. Each radio station will play a set of songs, and it will be defined by a combination of genre and decade.\r\nBecause the organisation serves a purpose to the project, the classification had to be done with a set of rules (aka The Radio Rules!):\r\nFew genres. Between 15 and 25.\r\nEach genre should have a decent pool of songs. I do not want a radio playing 6 songs time after time, I already have KISS FM Spain for that.\r\nEach song must be categorised using only one genre.\r\nEasy! Well, this task has consumed most of my free time since September 2020, and it isn’t over yet!\r\nBut Ricardo, shall I have any learning expectations from this post? Well, mostly no. This is a small resume of what you will find in the post:\r\nAn explanation on why classifying by genre is pointless and most people have already given up.\r\nThe currently existing software to automatise this task.\r\nMe ignoring every piece of software and instead, using Plato’s theory to classify my library in a list of genres.\r\nHow to get a CSV file with information about your library collection.\r\nHow to use R and last.fm API to retrieve information about an artist genre (this is the only section in which, potentially, you will actually learn something)\r\nWhy classifying by Genre is complicated.\r\n\r\n\r\n\r\nFigure 2: Library Statistic\r\n\r\n\r\n\r\nWhen I started this task I used my favourite search engine to see how can it be done. I ended up in some music forums and a lot of answers were that people gave up on classifying by genre. Why? Because genres are subjective. If I ask you who is the original artist of “Girls just wanna have fun”, there is only one right answer: Robert Hazard.1 You don’t get a simple answer when doing the same question about the genre. If you are a fan of Electronic music you might want to tag all the different styles (House, Ambient, Disco, Dub, Electro Swing…) whilst for another person (me!) all those styles might go under the tag EDM (In my case, the EDM tag is to group modern electronica like Techno, House, etc., and differentiate them from classic electronic music like Tubular Bells or Michael Jean Jarre).\r\nAnother problem is the gradualness of genres. Musicians have an inherent problem with making music that can be categorised into a nice simple genre. Those little bastards will try to have their own “style” and do you know how they do that? Yes, exactly, they got two genres and mix them (and not even 50%/50%). If a band now combines punk with metal. Is it punk? Is it metal? Is it a bird? Is it a plane? Is it a birdplane? This could not be a problem, but it collides with the set rule of only one genre per song.\r\nThis leads to the following quandary, uniqueness. Some artists have managed to create a genre so specific that no other band in the world plays. This occurs more often than I would like it2. Do I really want to classify Cartoons in the technobilly tag? No, I don’t, why anybody would like that? Plus it collides with each genre should have a decent pool of songs rule. A decision was taken, if some musician managed to invent a genre so specific that couldn’t be assigned to a broader genre(a.k.a. piss me off), then, their songs will be exiled into the wretched genre of “other”, and more likely they won’t be played again!\r\nResuming, classifying genres ain’t easy because of subjectivity, gradualness and uniqueness. So how did I solve this? Come up with a predefined list of genres. The list must have enough genres to successfully divide the music collection into sensible categories and adapt to my own criteria and library.\r\nSo the first step to start is, you need to come up with a list of genres. My starting point was the ID3v1 list of genres. The list contains a nice 80 tags to start with. Remove some tags (Top 40, Gospel) and add some other tags (EDM). Whatever list you come with here, you will change it later. This process is mostly iterative.\r\nYou don’t know how many songs will you have in a genre until you start. This translates into ending up with some genres with very few songs, and others including one-third of the music collection. In my case: New Age, Psychedelic, and Vocal contain less than 20 songs combined. Whilst, Classic Rock has 710 songs, and the almighty Pop has 1015 songs. Classic Rock and Pop are 43% of my library.\r\nI am currently reiterating all the process and trying to divide Pop into other subgenres like New Wave (already done) or electropop (currently working on this).\r\nSoftware to auto-sort by Genre\r\n\r\n\r\n\r\nFigure 3: Can’t someone else do it?\r\n\r\n\r\n\r\nBut can’t someone else just do it? Technically yes, but it will be a subpar job. The subjectivity, graduality and uniqueness will come to and screw up with your plans of letting a tool work for you. But if you do not trust me you can go and test them by yourself. Do what I did, create a 50 songs sample (Trial periods are limited to a certain amount of songs) and check if you are happy with their results.\r\nI will recommend you to start with the free Music Brainz Picard. This software will scan your music collection, assign them a “magic music hash id”. And compare with their own community giant database collection to retrieve the information.\r\nBut Ricardo, what if I think that you are a case of long pockets and short arms? What if one could spend some of their hard-earned sterling pounds and exchange them for goods and services. Services like finding a tool that just does it? Well, good news is that there are plenty of paid alternatives.\r\nDo not get me wrong, the tools work quite alright, almost like magic. But there are two problems:\r\nThey cannot work unattended, and if I need to revise everything they suggest me to do, the process is as slow as doing it by myself.\r\nThe way they work collides with my three radio rules.\r\nGetting philosophical about music classification\r\nI decided to assign every artist to a genre (as opposed to classify each song). The only exception in my library is the artist Dover, they started making rock music and later on (with plenty of controverse) moved to electropop.\r\n\r\n\r\n\r\nFigure 4: Plato listening to some form songs\r\n\r\n\r\n\r\nBut then I started to get philosophical. How can I determine what is Rock from what it isn’t? Is it Aerosmith rocker than Dire Straits? But why make myself such a question when great thinkers have already discussed plenty of theories? So in a nod to Plato’s theory of forms, I decided to give to every genre a master song. The master song will act as an “Idea” or “Form” of the genre. Like it is the only true representation of that genre.\r\nWhen I will have doubts about an artist being one or another genre, I will make myself the question, if I was the Radio Station DJ of the genre, will I play it next to the master song? If they couldn’t be played next to any master song, they would be exiled into the “other” tag.\r\nAre you curious to know my list of “Form songs”. There you have.\r\n\r\n\r\nThe Great Form Songs List\r\n    Genre\r\n      N. Songs\r\n      Form Song\r\n    alternative rock\r\n393\r\nMuse - Resistanceambient\r\n19\r\nMauro Picotto - Adiemusblues\r\n11\r\nLeonard Cohen - Suzanneclassic rock\r\n710\r\nDire Straits - Sultans of Swingclassical1\r\n1\r\nLudovico Einaudi - Nuvole Bianchecountry\r\n36\r\nToby Keith - God Love Herdisco\r\n67\r\nEarth, Wind & Fire - Boogie Wonderlandedm\r\n33\r\nAvicii - Hey Brotherelectronic\r\n84\r\nJean Michel Jarre - Oxygene, Pt 4electropop2\r\n8\r\nOwl City - Fireflieseurodance\r\n27\r\nEiffel 65 - Bluefolk\r\n28\r\nSimon & Garfunkel - The sound of silencefreak metal\r\n82\r\nEl Reno Renardo - El Bogavantegothic1\r\n4\r\nEvanescence - Lithiumgrunge\r\n18\r\nThe Smashing Pumpkins - Bullet With Butterfly Wingshard rock\r\n107\r\nScorpions - She's Knocking At My Doorhip-hop3\r\n50\r\nEminem - Lose Yourselfjazz\r\n61\r\nLouis Armstrong - What a Wonderful Worldlatin\r\n14\r\nMiami Sound Machine - Congalo-fi4\r\n1\r\nGrizzly Bear - Two Weeksmetal\r\n36\r\nStratovarius - 4000 Rainy Nightsnew age4\r\n2\r\nSally Oldfield - Mirrorsnew wave2\r\n234\r\nAlphaville - Forever Youngoldies\r\n584\r\nThe Foundations - Build Me Up Buttercupother\r\n39\r\nWhere exiled song come to diepop\r\n1015\r\nColdplay - The Hardest Partpsychedelic4\r\n2\r\n? and The Mysterians - 96 Tearspunk\r\n92\r\nThe Offspring - Pretty Flyreggae\r\n25\r\nEddy Grant - Gimme Hope Jo'annarock\r\n104\r\nMen at Work - Down Underrockabilly\r\n5\r\nThe Baseballs - Umbrellaska4\r\n5\r\nStreetlight Manifesto - A Moment of Silencesoul\r\n70\r\nRoberta Flack - Killing Me Softly with his songsoundtrack\r\n14\r\nJohn Travolta - Greased Lightnin'vocal4\r\n1\r\nThe Blanks - Hey ya!\r\n        \r\n          1\r\n          \r\n           \r\n          There is another music collection that will eventually join this one and will enlarge this genre.\r\n          \r\n        \r\n          2\r\n          \r\n           \r\n          Created to reduce the size of Pop.\r\n          \r\n        \r\n          3\r\n          \r\n           \r\n          Hip-Hop already contains all songs previously marked as Rap\r\n          \r\n        \r\n          4\r\n          \r\n           \r\n          This genre will be removed due to having a small pool of songs.  \r\n          \r\n      \r\n    \r\n\r\nLess philosophy and more coding!\r\n\r\n\r\n\r\nFigure 5: Time to code!\r\n\r\n\r\n\r\nI have written this post to teach philosophy and code in R… and I’m all out of theories.\r\nWe need to pass our music library info to R, so we need a CSV file with information about our library. Tagscanner is our man. Scan your library, and in the export tab, save it as an “Excel friendly” CSV file. Don’t forget to check the UTF-8 with DOM option. Mind that from this moment until you finish, you must not modify your library by adding, removing or editing any file here.\r\nThen we need a database to get information from. Get a last.fm API so we can access their database and load it into our R code. Sign in for an API request and get your API key, your API key is a hexadecimal number that should look similar to this one “0123456789abcdef0123456789abcdef”, and gives you permission to use their database.\r\nIf you don’t have R and Rstudio ready on your computer, stop making bad decisions in your life and go download and install them. You will also need the urltools and jsonlite libraries. We will be creating some functions that will help us to retrieve information from last.fm database.\r\nlibrary(urltools)\r\nlibrary(jsonlite)\r\n\r\n# Add your Last.fm API Here\r\nlastFM_API = \"0123456789abcdef0123456789abcdef\"\r\n\r\n# This function returns the JSON URL for certain Artist\r\nbuild_artist_info <- function(artist,\r\n        api_key= lastFM_API,\r\n        base = \"http://ws.audioscrobbler.com/2.0/\"){\r\n    base <- param_set(base, \"method\", \"artist.getInfo\")\r\n    base <- param_set(base, \"artist\", URLencode(artist))\r\n    base <- param_set(base, \"api_key\", api_key)\r\n    base <- param_set(base, \"format\", \"json\")\r\n    return(base)\r\n}\r\nThe function: build_artist_info(artist = \"Aqua\") generates a URL pointing to the Artist requested JSON file with information about them. If the artist doesn’t exist, you will get an URL but it won’t return anything. Copy this URL into Firefox so you can take a look at the JSON file and familiarise yourself with it. But don’t forget that we don’t need to load the JSON in firefox. We need the data to be in R. The way to do this is using the function fromJSON().\r\n    fromJSON(build_artist_info(artist = \"Aqua\"))\r\nThis function will read the JSON, and convert it to an R format (list of lists). Don’t hesitate to save this into a dummy variable and check the info in the environment panel of Rstudio, it shouldn’t differ from what you saw on Firefox. To access the top 5 last.fm genre is as easy as navigating through the data to:\r\n    fromJSON(build_artist_info(artist = \"Aqua\"))$artist$tags$tag$name\r\n\r\n\r\n\r\nFigure 6: Rstudio showing my real last.fm API\r\n\r\n\r\n\r\nWith our new superb functions, we are ready to import the tracklist from step 1 into R and start getting genres! You will have to read the tracklist without a header because Tagscanner doesn’t give one. There are a few peculiarities on my example code snip shown below. I am not reading the first row as column names (Tagscanner default output), that my separator is “;” (because I am in a Spanish computer), I am forcing reading every column as a character (to avoid having to deal with factors) and forcing the file encoding (to UTF-8-DOM, as I asked you before).\r\n# Read the csv with the library information\r\ntracklist = read.table(r\"(B:\\Doc...\\tracklist.csv)\",\r\n    header = FALSE,\r\n    sep = \";\",\r\n    fileEncoding = \"UTF-8-BOM\",\r\n    colClasses = rep(\"character\",14))\r\n\r\n# Get a list of Artists\r\nUniqueArtistList = unique(tracklist$V2)\r\n\r\n# For each artist, provide me with the 5 top genre tags\r\nArtistGenresList = sapply( UniqueArtistList, function(x){fromJSON(build_artist_info(x))$artist$tags$tag$name})\r\nDepending on the size of your artist list, this command can take a while to run, so it wouldn’t hurt trying in a subset of artists first. You will end up with a list of artist, which contains a list of 5 tags, or an empty list if they couldn’t find the artist (likely you wrote the artist name incorrectly).\r\nAt this point, I decided to code some really fancy scripts to auto-tag everything based on few rules (like checking decade and genre with my list of genres, and prioritising one tag over others tag, condense them into a single tag, etc…). Remember what I said about the tools that help you doing the classification? Yes, they suck! Well, turns out that my script was doing a subpar job too. Chances are that you end up having to review all information so I decided to export all info into a spreadsheet instead, and go fully manual from there.\r\nThis piece of code is to get a data frame with the artist, the 5 genres and a score for each one (starting at 0). The score should help you decide which genre is more suitable, more details below.\r\n# Create Empty data.frame\r\ndf3 = data.frame()\r\n\r\n# Function to expand data\r\nexpand_genre_todf <- function(x){\r\n    y = unlist(x)\r\n    if (length(y) == 5) {\r\n        res = data.frame(Artist = names(x),\r\n            genre1 = y[1],F1 = 0,\r\n            genre2 = y[2],F2 = 0,\r\n            genre3 = y[3],F3 = 0,\r\n            genre4 = y[4],F4 = 0,\r\n            genre5 = y[5],F5 = 0,\r\n            row.names = NULL)\r\n    } else {\r\n        res = data.frame(Artist = names(x),\r\n            genre1 = NA,F1 = 0,\r\n            genre2 = NA,F2 = 0,\r\n            genre3 = NA,F3 = 0,\r\n            genre4 = NA,F4 = 0,\r\n            genre5 = NA,F5 = 0,\r\n            row.names = NULL)\r\n    }\r\n    return(res)\r\n}\r\n\r\n# Build dataframe\r\nfor (i in 1:length(ArtistGenresList)) {\r\n    df3 = rbind(df3, expand_genre_todf(ArtistGenresList[i]))\r\n}\r\nThe scoring system can be as complicated as you want, I decided to keep it simple3. The score will be 0 if the last.fm genre is not in my master genre list and 1 if it is. How do we do that? String comparison! Well almost that. The code shown below is a little bit more complicated than just comparing two strings, I called it “the smarter string comparison”. Don’t judge me, I need to keep coming with those catchy names to keep you reading\r\nWhy the smarter string comparison? A simple string comparison between “hip-hop” and “Hip Hop” would give me a false, which I don’t want. To solve this, I am converting everything into capital letters, and generating a coefficient between them with the function adist and the number of characters to check if the tags are similar enough. The value of 0.2 was found after trial and error, and consistently produced good results with almost no false positives. If my Fortran90 teacher who (tried to) taught me to avoid using magic numbers reads this post, I am really sorry Don Requena, it will not happen again.\r\n# Read our list of genres\r\ngenrelist = read.table(r\"(B:\\Documents\\R\\RMusicOrganiser\\_ss\\GenreList.csv)\",\r\n    header = FALSE,\r\n    sep = \",\",\r\n    fileEncoding = \"UTF-8\")$V1\r\n# Add filtering\r\nfor (i in c(2,4,6,8,10)){\r\n  for (j in 1:nrow(df3)){\r\n    xg = toupper(df3[j,i])\r\n    if (!is.na(xg)){\r\n      if (any(adist(xg,toupper(genrelist))/nchar(xg) < 0.2)) {df3[j,i+1]=1}\r\n    }\r\n  }\r\n}\r\n\r\n\r\n\r\nFigure 7: Libre Office with the outcoming file\r\n\r\n\r\n\r\nAnd we can end up by writing this file into a CSV that we can open with your favourite spreadsheet program.\r\nwrite.table(df3, file = r\"(B:\\Documentos\\GitHub\\RMusicOrganiser\\Artist_Genre.csv)\",\r\n    sep = \",\",\r\n    row.names = FALSE)\r\nFrom here, there is a lot of listening to the music, assign a genre, rinse and repeat. Several months later, if you manage to finish this task instead of playing the three Mass Effect games in a row (cough…, cough…), you would need to update the original tracklist.csv. Update the genre column with your new genres, and use TagScanner to import the information into the library. Hence the importance of not updating, adding or removing songs, or the whole process would be screwed.\r\n\r\nI bet you weren’t expecting him!↩︎\r\nWhich is none, I would like to happen “none” times!↩︎\r\nLies!, I started doing an extremely complex scoring system that turned out to be rubbish, then move to the simple system.↩︎\r\n",
    "preview": "posts/2021-06-12-classifying-your-music-library-by-genre-using-r-and-lastfm-api/images/2021-06-12_Image1.png",
    "last_modified": "2021-11-16T18:23:05+00:00",
    "input_file": {},
    "preview_width": 1165,
    "preview_height": 772
  },
  {
    "path": "posts/2020-09-22-games-in-excelvba-2048-and-minesweeper/",
    "title": "Games in Excel/VBA 2048 and minesweeper",
    "description": "I made the game 2048 and Mine-Sweeper in Excel/VBA to self-teach Excel coding. The code is not optimal but they do work!",
    "author": [
      {
        "name": "Ricardo Montero Rubert",
        "url": "https://blog.rmrubert.eu/about"
      }
    ],
    "date": "2020-09-22",
    "categories": [],
    "contents": "\r\nA long time ago I found myself with a task that required with fairly large load times and I decided to use that time in order to create some simple games in Excel/VBA, it was a good way to get familiar with Excel/VBA which is always a nice skill to have. In this case, the games that I coded were 2048 and the classic Minesweeper.\r\nTL;DR: Download the 2048 game, or Download the minesweeper game.\r\nI must warn anyone wanting to see the code, that the games are “as they were coded three years ago” and I have not bothered to rewrite or organise the code since 2017. Obviously, you will require to trust me, and allow macros in order to be able to use them.\r\n2048\r\n\r\n\r\n\r\nFigure 1: Screenshot of the game 2048 game running in Excel.\r\n\r\n\r\n\r\nThe game is pretty straight forward and follows the same rules that the android game with the same name. Select a cell, and then press one of the arrows to push the cell in that direction. Cells need to be pushed against one of the same value until you will manage to reach 2048. The game won’t tell you when there are no more available moves. The game has been tested and works on LibreOffice 7.\r\nDownload.\r\nMinesweeper (v2)\r\n\r\n\r\n\r\nFigure 2: Screenshot of the game Mine-Sweeper game running in Excel.\r\n\r\n\r\n\r\nApparently, there was a version 1 of this game that I must have lost at some point. You will require to tag all the mines until there all of them are tagged. To tag or dig, select a cell and click on the tag or dig button. Mind that the routine that checks all mine-empty terrain has not been optimised so it might take a few seconds to get all revealed. You could technically go to the second page to see the results, but please don’t (or do it, but it won’t be a fair play!). The game is unable to work on LibreOffice 7, which is not surprising as it was designed for Excel 2013.\r\nDownload.\r\n\r\n\r\n\r\n",
    "preview": "posts/2020-09-22-games-in-excelvba-2048-and-minesweeper/images/2020-09-22_Image0.png",
    "last_modified": "2021-11-16T22:13:50+00:00",
    "input_file": {},
    "preview_width": 707,
    "preview_height": 537
  },
  {
    "path": "posts/2020-07-03-uk-map/",
    "title": "UK map",
    "description": "Just a drawing of the Great Britain island in the style of Tolkyen.",
    "author": [
      {
        "name": "Ricardo Montero Rubert",
        "url": "https://blog.rmrubert.eu/about"
      }
    ],
    "date": "2020-07-03",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\nFigure 1: Great Britain island in the style of Tolkyen\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2020-07-03-uk-map/images/map-GB.jpg",
    "last_modified": "2021-10-07T18:44:28+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-06-30-notepad-theme-solarized-dark-version-for-tuflow-fm-and-markdown-files/",
    "title": "Notepad++ theme (Solarized Dark) version for tuflow, FM and markdown files.",
    "description": "User-defined files for Notepad++ that colourise Tuflow configuration files (tcf, tgc, tbc, tmf, ecf, tlf...), Flood Modeller simulation files (ief) and markdown (md) files with the Solarized Dark colour scheme.",
    "author": [
      {
        "name": "Ricardo Montero Rubert",
        "url": "https://blog.rmrubert.eu/about"
      }
    ],
    "date": "2020-06-30",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\nFigure 1: Notepad++ Screenshot\r\n\r\n\r\n\r\nThose who work with me know that I am a fan of dark themes on applications. However, until today I used to use a different dark scheme for each application/language. Weeks ago I discovered Solarized and fell in love with it, to the point that not only have I changed all my others skins to Solarized but also I have started to create them following Solarized colour scheme.\r\nThis blog post is to announce three new UDL (User Defined Languages) with a Dark Solarized scheme for Flood Modeller (IEF) files, TUFLOW (TCF, TGC, TBC) files and Markdown (MD) files.\r\nCheck the GitHub repository below if you are interested in downloading them.\r\nDownload\r\nGitHub repository\r\nAcknowledgments\r\nFlood Modeller UDL file is based on my previous dark scheme and it is an original work.\r\nTuflow UDL file relies on this file, although it has been modified to include a few features.\r\nMarkdown UDL file is based on a tweaked version of the duotone markdown UDL file, it has been modified to work better with markdown for Jekyll.\r\n\r\n\r\n\r\n",
    "preview": "posts/2020-06-30-notepad-theme-solarized-dark-version-for-tuflow-fm-and-markdown-files/images/Notepad_Solarized.png",
    "last_modified": "2021-10-08T22:29:54+01:00",
    "input_file": {},
    "preview_width": 935,
    "preview_height": 771
  }
]
